import React from "react";

function Iftar() {
  return (
    <div>
      <h1>ইফতার</h1>
      <p>
        باب فَضْلِ السُّحُورِ وَتَأْكِيدِ اسْتِحْبَابِهِ وَاسْتِحْبَابِ
        تَأْخِيرِهِ وَتَعْجِيلِ الْفِطْرِ حَدَّثَنَا يَحْيَى بْنُ يَحْيَى،
        أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ
        سَهْلِ، بْنِ سَعْدٍ - رضى الله عنه - أَنَّ رَسُولَ اللَّهِ صلى الله عليه
        وسلم قَالَ " لاَ يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ " .
      </p>
      <p>
        সাহল ইবনে সা’দ (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ (ﷺ) বলেন যতদিন মানুষ
        বিলম্ব না করে ইফতার করবে ততদিন তারা কল্যাণের উপর থাকবে। (সহীহ মুসলিম)
      </p>
      <p>
        দ্রুত ইফতার করা ছিল নবীগণের বৈশিষ্ট্য। সাহাবায়ে কেরামও দ্রুত ইফতার
        করতেন। নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন-
      </p>
      <p>لاَ يَزَالُ النّاسُ بِخَيْرٍ مَا عَجّلُوا الفِطْرَ.</p>
      <p>
        মানুষ ততদিন খায়র ও কল্যাণের মাঝে থাকবে যতদিন তারা সময় হওয়ার সাথে সাথে
        দ্রুত ইফতার করবে। (সহীহ বুখারী)
      </p>
      <h3>ইফতারের সময় হাদীস শরীফে এ দুআ পড়ার কথা এসেছেঃ</h3>
      <p>اللّهُمّ لَكَ صُمْتُ، وَعَلَى رِزْقِكَ أَفْطَرْتُ.</p>
      <p>
        আয় আল্লাহ! আপনার সন্তুষ্টির উদ্দেশ্যেই রোযা রেখেছি এবং আপনার রিযিক দিয়েই
        ইফতার করেছি।
      </p>
      <h3>রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই দুআও পড়তেন-</h3>
      <p>
        ذَهَبَ الظّمَأُ وَابْتَلّتِ الْعُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ
        اللهُ.
      </p>
      <p>
        পিপাসা নিবারিত হল, শিরা-উপশিরা সতেজ হল। আর আল্লাহ চাহে তো সওম-এর সওয়াব
        প্রাপ্তির খাতায় লিপিবদ্ধ হল।
      </p>
    </div>
  );
}

export default Iftar;
