import React from "react";

function Istinja() {
  return (
    <>
      <div>
        <h1 className="text-xl font-bold mb-5">
          কয়েক দিকে ফিরে ইস্তিঞ্জা করা নিষেধ
        </h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। কিবলার দিকে মুখ করে।</p>
          <p>২। কিবলার দিকে পিঠ করে।</p>
          <p>৩। চন্দ্র ও সূর্যের দিকে মুখ করে।</p>
          <p>৪। প্রবল বাতাসের দিকে মুখ করে।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">
          ১০ জায়গায় ইস্তিঞ্জা করা নিষেধ
        </h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। মানুষ চলাচলের রাস্তায়।</p>
          <p>২। ছায়াদার বা ফলদার গাছের নীচে।</p>
          <p>৩। উযু-গোসলের স্থানে।</p>
          <p>৪। গর্তের ভিতরে, গোরস্তানে।</p>
          <p>৫। দাঁড়িয়ে বা হেঁটে হেঁটে।</p>
          <p>৬। বিনা উযরে পানিতে।</p>
          <p>৭। ঘরে বা বিছানায়।</p>
          <p>৮। মসজিদের আঙ্গিনায় বা ঈদগাহে।</p>
          <p>৯। নীচু জায়গায় বসে উঁচু জায়গায়।</p>
          <p>১০। জনসম্মুখে।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">
          ৬ জিনিস নিয়ে ইস্তিঞ্জায় যাওয়া নিষেধ
        </h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। আল্লাহ তা‘আলার নাম।</p>
          <p>২। নবীগণের নাম।</p>
          <p>৩। ফেরেশতাগণের নাম।</p>
          <p>৪। কুরআনের আয়াত।</p>
          <p>৫। হাদীসের টুকরা।</p>
          <p>৬। দু‘আ কালাম। (লিখিত বা অংকিত)</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">
          ইস্তিঞ্জার সময় ৮ কাজ করা নিষেধ
        </h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। কথা বলা ।</p>
          <p>২। যিকির করা ।</p>
          <p>৩। কুরআন শরীফ তিলাওয়াত করা ।</p>
          <p>৪। সালাম দেওয়া ।</p>
          <p>৫। সালামের উত্তর দেওয়া ।</p>
          <p>৬। খাওয়া ও পান করা ।</p>
          <p>৭। মিসওয়াক করা ।</p>
          <p>৮। লেখা পড়া।</p>
        </div>
      </div>
    </>
  );
}

export default Istinja;
