import React from "react";

function RojaFazael() {
  return (
    <>
      <div>
        <h1 className="text-xl font-bold mb-5">
          দিনের বেলা রোযা রাখাকে ফরজ করে পবিত্র কুরআনে বলা হয়েছে
        </h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>
            یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا کُتِبَ عَلَیۡکُمُ الصِّیَامُ کَمَا
            کُتِبَ عَلَی الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّکُمۡ تَتَّقُوۡنَ ۙ
          </p>
          <p>
            হে ঈমানদারগণ! তোমাদের উপর রোজা ফরয করা হয়েছে, যেরূপ ফরজ করা হয়েছিল
            তোমাদের পূর্ববর্তী লোকদের উপর, যেন তোমরা পরহেযগারী অর্জন করতে
            পার। সূরা বাকারা, আয়াত:১৮৩
          </p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">হাদীস থেকে</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>
            باب صَوْمُ رَمَضَانَ احْتِسَابًا مِنَ الإِيمَانِ حَدَّثَنَا ابْنُ
            سَلاَمٍ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا
            يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ،
            قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم " مَنْ صَامَ
            رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ
            ذَنْبِهِ ".
          </p>
          <p>
            সাহাবী হযরত আবু হুরায়রা (রা:) রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম
            থেকে বর্ণনা করেন, রাসূল সাল্লল্লাহ আলাইহি ওয়াসাল্লাম বলেন: যে
            ব্যক্তি ঈমানী চেতনায় উজ্জীবিত হয়ে পরকালীন প্রতিদান কামনায় রমযানের
            রোযা রাখবে তার অতীত জীবনের সকল পাপ ক্ষমা করে দেয়া হবে।(সহীহ বুখারী)
          </p>
        </div>
      </div>
    </>
  );
}

export default RojaFazael;
