import React from "react";

function Terms() {
  return (
    <div className="bg-[#F7F3DE] text-[#2e424d] px-[100px] py-10 text-xl">
      <h1 className="bg-[#98dad9] text-center py-5 rounded-md font-bold text-2xl">
        শর্তাবলী
      </h1>
      <div className="space-y-5 py-10">
        <h1 className="text-start text-2xl font-bold">
          শর্তাবলীর গ্রহণযোগ্যতা
        </h1>
        <p>
          ওয়েবসাইটে প্রবেশ ও ব্যবহার করে, আপনি নিম্নলিখিত শর্তাবলীর সাথে সম্মত
          হন এবং তা মেনে চলার জন্য বাধ্য থাকবেন। আপনি যদি এই শর্তাবলীর কোনো
          অংশের সাথে একমত না হন, তাহলে অনুগ্রহ করে ওয়েবসাইটটি ব্যবহার করবেন না।
        </p>
      </div>
      <div className="space-y-5 pb-10">
        <h1 className="text-start text-2xl font-bold">ওয়েবসাইটের উদ্দেশ্য</h1>
        <p>
          একটি ইসলামিক ওয়েবসাইট, যা কোরআন, হাদিস, দোয়া, সুন্নাহ এবং অন্যান্য
          বিষয়গুলির বিষয়ে নির্ভরযোগ্য তথ্য এবং রিসোর্স প্রদান করে। এই
          বিষয়বস্তু শুধুমাত্র শিক্ষা ও তথ্যের উদ্দেশ্যে প্রদান করা হয়েছে এবং
          এটি পেশাদার ধর্মীয় নির্দেশনার বিকল্প হিসেবে ব্যবহার করা উচিত নয়।
        </p>
      </div>
      <div className="space-y-5 pb-10">
        <h1 className="text-start text-2xl font-bold">বিষয়বস্তু সঠিকতা</h1>
        <p>
          প্রদত্ত বিষয়বস্তুর সঠিকতা এবং প্রামাণিকতা নিশ্চিত করার জন্য আমরা
          সর্বাত্মক চেষ্টা করি, তবে আমরা সব তথ্যের ত্রুটি বা আপডেটের জন্য
          গ্যারান্টি দিই না। প্রদত্ত বিষয়বস্তু ইসলামিক শিক্ষার ওপর ভিত্তি করে
          প্রদান করা হয়েছে এবং ব্যবহারকারীদের যথার্থতা যাচাইয়ের জন্য আলেমদের
          বা বিশ্বস্ত উৎসের সাথে পরামর্শ করতে উত্সাহিত করা হয়।
        </p>
      </div>
      <div className="space-y-5 pb-10">
        <h1 className="text-start text-2xl font-bold">ব্যবহারকারীর আচরণ</h1>
        <p>
          ব্যবহারকারীদের সম্মানজনক এবং নৈতিক আচরণ প্রদর্শন করতে হবে। আপনি সম্মত
          হন যে আপনি-কোনো ধরনের আপত্তিকর, অসম্মানজনক বা ইসলামিক শিক্ষার পরিপন্থী
          বিষয়বস্তু পোস্ট বা শেয়ার করবেন না। ওয়েবসাইটটি কোনো অবৈধ কার্যকলাপের
          জন্য বা সহিংসতা, ঘৃণা বা বৈষম্য প্রচারের জন্য ব্যবহার করবেন না।
          ওয়েবসাইটের কার্যকারিতা বা নিরাপত্তার সাথে হ্যাক, ক্ষতি বা হস্তক্ষেপ
          করার চেষ্টা করবেন না।
        </p>
      </div>
      <div className="space-y-5 pb-10">
        <h1 className="text-start text-2xl font-bold">অনুদান</h1>
        <p>
          ওয়েবসাইটের রক্ষণাবেক্ষণ এবং উন্নয়নের জন্য অনুদান গ্রহণ করে। সমস্ত
          অনুদান স্বেচ্ছাসেবী এবং অপরিবর্তনীয়। ওয়েবসাইটের ইসলামিক জ্ঞান
          ছড়িয়ে দেওয়ার মিশনের সাথে সামঞ্জস্য রেখে প্রাপ্ত তহবিল ব্যবহারের
          জন্য আমরা প্রতিশ্রুতিবদ্ধ।
        </p>
      </div>
    </div>
  );
}

export default Terms;
