import React from "react";

function NamazerForoz() {
  return (
    <>
      <div>
        <h1 className="text-xl font-bold mb-5">নামাযের বাইরে ৭ ফরয</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p> ১। শরীর পাক। </p>
          <p> ২। কাপড় পাক। </p>
          <p> ৩। নামাযের জায়গা পাক। </p>
          <p> ৪। সতর ঢাকা। </p>
          <p> ৫। কিবলামুখী হওয়া।</p>
          <p> ৬। ওয়াক্ত মত নামায পড়া।</p>
          <p>৭। নামাযের নিয়ত করা।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">নামাযের ভিতরে ৬ ফরয</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p> ১। তাকবীরে তাহরীমা বলা। </p>
          <p> ২। দাঁড়িয়ে নামায পড়া।</p>
          <p> ৩। ক্বিরা‘আত পড়া।</p>
          <p>৪। রুকু করা। </p>
          <p> ৫। দুই সিজদা করা।</p>
          <p>৬। আখিরী বৈঠক করা।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">নামাযের ওয়াজিব ১৪টি</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p> ১। সূরা ফাতিহা পুরা পড়া। </p>
          <p> ২। সূরা ফাতিহার সঙ্গে সূরা মিলানো।</p>
          <p> ৩। রুকু-সিজদায় দেরী করা।</p>
          <p> ৪। রুকু হতে সোজা হয়ে দাঁড়ানো। </p>
          <p>৫। দুই সিজদার মাঝখানে সোজা হয়ে বসা।</p>
          <p>৬। প্রথমে বৈঠক করা। </p>
          <p>৭। উভয় বৈঠকে আত্তাহিয়্যাতু পড়া। </p>
          <p>৮। ইমামের জন্য ক্বিরা‘আত আস্তে এবং জোরে পড়া।</p>
          <p> ৯। বিতরের নামাযে দু‘আয়ে কুনূত পড়া।</p>
          <p> ১০। দুই ঈদের নামাযে ছয়টি করে তাকবীর বলা। </p>
          <p>
            ১১। ফরয নামাযের প্রথম দুই রাকা‘আতকে কিরাআতের জন্য নির্ধারিত করা।
          </p>
          <p> ১২। প্রত্যেক রাকা‘আতের ফরযগুলোর তারতীব ঠিক রাখা।</p>
          <p> ১৩। প্রত্যেক রাকা‘আতের ওয়াজিবগুলোর তারতীব ঠিক রাখা। </p>
          <p>১৪। ‘সালাম’ বলে নামায শেষ করা।</p>
        </div>
      </div>
    </>
  );
}

export default NamazerForoz;
