[   
{
  "id": 1,
  "name": "After Salah #1",
  "arabic": "أَسْتَغْفِرُ اللهَ (3) اَللّٰهُمَّ أَنْتَ السَّلَامُ ، وَمِنْكَ السَّلَامُ ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
  "uccharon": "Astaghfiru-llāh (x3), Allāhumma Anta-s-Salām, wa minka-s-salām, tabārakta yā Dha-l-Jalāli wa-l-Ikrām.",
  "meaning":"I seek the forgiveness of Allah. O Allah, You are The Flawless and The Source of Peace, and from You comes peace. Blessed are You, full of Majesty and Honour."
},
{
    "id": 2,
    "name": "After Salah #2",
    "arabic": "لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ ، اَللّٰهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَـدِّ مِنْكَ الْجَـدُّ",
    "uccharon": "Lā ilāha illā-llāhu waḥdahū lā sharīka lah, lahu-l-mulku, wa lahu-l-ḥamd, wa Huwa ʿalā kulli shay’in Qadīr, Allāhumma lā māniʿa li-mā aʿaṭayt, wa lā muʿṭiya li-mā manʿat, wa lā yanfaʿu dha-l-jaddi minka-l-jadd.",
    "meaning":"There is no god but Allah. He is Alone and He has no partner whatsoever. To Him Alone belong all sovereignty and all praise. He is over all things All-Powerful. O Allah, there is none who can withhold what You give, and none can give what You withhold; and the wealth of the wealthy does not avail them against You."
  },
  {
    "id": 3,
    "name": "After Salah #3",
    "arabic": "اَللَّٰهُمَّ أَعِنِّيْ عَلَىٰ ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "uccharon": "Allāhumma aʿinnī ʿalā dhikrika wa shukrika wa ḥusni ʿibādatik.",
    "meaning":"O Allah, help me in remembering You, in being grateful to You, and in worshipping You in an excellent manner."
  },
  {
    "id": 4,
    "name": "After Salah #4",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلََىٰ أَرْذَلِ الْعُمُرِ ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وأَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ",
    "uccharon": "Allāhumma innī aʿūdhu bika mina-l-bukhl, wa aʿūdhu bika mina-l-jubn, wa aʿūdhu bika min an uradda ilā ardhali-l-ʿumur, wa aʿūdhu bika min fitnati-d-dunyā, wa aʿūdhu bika min ʿadhābi-l-qabr.",
    "meaning":"O Allah, I seek Your protection from miserliness and I seek Your protection from cowardice. I seek Your protection from being sent back to a miserable old age. I seek Your protection from the trials of the world and I seek Your protection from the punishment of the grave."
  },
  {
    "id": 5,
    "name": "After Salah #5",
    "arabic": "سُبْحَانَكَ وَبِحَمْدِكَ ، لَا إِلٰه إِلَّا أَنْتَ ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
    "uccharon": "Subḥānaka wa bi ḥamdik, lā ilāha illā Ant, astaghfiruka wa atūbu ilayk.",
    "meaning":"You are free from imperfection, and all praise is to You. There is no god but You. I seek Your forgiveness and turn to You in repentance."
  },
  {
    "id": 6,
    "name": "To be Read after Fajr & Maghrib #1",
    "arabic": "(10X) لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِيْ وَيُمِيْتُ ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيْرٌ",
    "uccharon": "Lā ilāha illā-llāhu waḥdahū lā sharīka lah, lahu-l-mulku wa lahu-l-ḥamdu yuḥyī wa yumīt, wa Huwa ʿalā kulli shay’in Qadīr",
    "meaning":"There is no god but Allah. He is Alone and He has no partner whatsoever. To Him Alone belong all sovereignty and all praise. He gives life and He gives death. He is over all things All-Powerful."
  },
  {
    "id": 7,
    "name": "To be Read after Fajr & Maghrib #2",
    "arabic": "اَللّٰهُمَّ أَجِرْنِيْ مِنَ النَّارِ",
    "uccharon": "Allāhumma ajirnī mina-n-nār.",
    "meaning":"O Allah, protect me from the Hell-fire."
  },
  {
    "id": 8,
    "name": "Read after Fajr",
    "arabic": "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا ، وَرِزْقًا طَيِّبًا ، وَعَمَلًا مُتَقَبَّلًا",
    "uccharon": "Allāhumma innī as'aluka ʿilma-n-nāfiʿā, wa rizqan ṭayyibā, wa ʿamalam-mutaqabbalā.",
    "meaning":"O Allah, I ask You for beneficial knowledge, wholesome sustenance, and deeds which are accepted."
  },
  {
    "id": 9,
    "name": "Read after Witr",
    "arabic": "(3X) سُبْحَانَ الْمَلِكِ الْقُدُّوْسِ",
    "uccharon": "Subḥāna-l-Maliki-l-Quddūs.",
    "meaning":"How perfect is the Sovereign, the Most Holy."
  }
]