[
    {
  "id": 1,
  "name": "Mercy & Protection",
  "arabic": "بِاسْمِكَ رَبِّيْ وَضَعْتُ جَنْبِيْ ، وَبِكَ أَرْفَعُهُ ، فَإِنْ أَمْسَكْتَ نَفْسِيْ فَارْحَمْهَا ، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَالصَّالِحِيْنَ",
  "uccharon": "Bismika Rabbī waḍaʿtu jambī, wa bika arfaʿuh, fa in amsakta nafsī fa-r-ḥamhā, wa in arsaltahā, fa-ḥ-faẓhā bimā taḥfaẓu bihī ʿibādaka-s-sāliḥīn.",
  "meaning":"In Your Name my Lord, I lie down, and in Your Name, I rise. If You take my soul away then have mercy upon it, and if You return my soul then protect it with what you protect Your righteous servants with."
},
{
    "id": 2,
    "name": "Protection from Punishment",
    "arabic": "اَللّٰهُمَّ قِنِيْ عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
    "uccharon": "Allāhumma qinī ʿadhābaka yawma tabʿathu ʿibādak.",
    "meaning":"O Allah, protect me from Your punishment on the day You resurrect Your servants."
  },
  {
    "id": 3,
    "name": "Thank Allah for Blessing you",
    "arabic": "اَلْحَمْدُ للهِ الَّذِيْ أَطْعَمَنَا وَسَقَانَا ، وَكَفَانَا ، وَآوَانَا ، فَكَمْ مِّمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
    "uccharon": "Al-ḥamdu li-llāhi-l-ladhī aṭʿamanā wa saqānā, wa kafānā, wa āwānā, fakam-mim-man lā kāfīya lahū walā mu’wiy.",
    "meaning":"All praise is for Allah, Who provided us food and drink and Who sufficed us and has sheltered us; for how many have none to suffice them or shelter them."
  },
  {
    "id": 4,
    "name": "Protect yourself from the Evils",
    "arabic": "اَللّٰهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ ، أَعُوْذُ بِكَ مِنْشَرِّ نَفْسِيْ ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَىٰ نَفْسِيْ سُوْءًا ، أَوْ أَجُرَّهُ إِلَىٰ مُسْلِمٍ",
    "uccharon": "Allāhumma ʿālima-l-ghaybi wa-sh-shahādah, fāṭir-as-samāwāti wa-l-arḍi rabba kulli shay’iw-wa malīkah, ash-hadu al-lā ilāha illā Anta, aʿūdhu bika min sharri nafsī wa min sharri-sh-shayṭāni wa shirkihī wa an aqtarifa ʿalā nafsī sū’an aw ajurrahū ilā muslim.",
    "meaning":"O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of everything; I bear witness that there is no god but You. I seek Your protection from the evil of my own self, from the evil of Shaytān and from the evil of polytheism to which he calls, and from inflicting evil on myself, or bringing it upon a Muslim."
  },
  {
    "id": 5,
    "name": "Protection, Well-being and Forgiveness",
    "arabic": "اَللّٰهُمَّ إِنَّكَ خَلَقْتَ نَفْسِيْ وَأَنْتَ تَوَفَّاهَا ، لَكَ مَمَاتُهَا وَمَحْيَاهَا ، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا ، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا ، اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَالْعَافِيَة",
    "uccharon": "Allāhumma innaka khalaqta nafsī wa Anta tawaffāhā, laka mamātuhā wa maḥyāhā, in aḥyaytahā fa-ḥfaẓhā, wa in amattahā fa-ghfir lahā, Allāhumma innī as’aluka-l-ʿāfiyah.",
    "meaning":"O Allah, verily You have created my soul and You shall take its life. To You Alone belongs its life and death. If You keep my soul alive then protect it, and if You take it away, then forgive it. O Allah, I ask You to grant me well-being."
  },
  {
    "id": 6,
    "name": "Forgiveness & Protection",
    "arabic": "بِسْمِ اللهِ وَضَعْتُ جَنْبِيْ ، اَللّٰهُمَّ اغْفِرْ لِيْ ذَنْبِيْ ، وَأَخْسِئْ شَيْطَانِيْ ، وَفُكَّ رِهَانِيْ ، وَاجْعَلْنِيْ فِي النَّدِيِّ الْأَعْلَىٰ",
    "uccharon": "Bismillāhi waḍaʿtu jambī, Allāhumma-ghfir lī dhambī, wa akhsi’ shayṭānī, wa fukka rihānī, wa-jʿalnī fi-n-Nadiyyi-l-Aʿlā.",
    "meaning":"In the Name of Allah, I lie down. O Allah, forgive my sins, ward off from me my shaytān, free me from my obligations (to others) and enter me into the loftiest assembly (of angels)."
  },
  {
    "id": 7,
    "name": "Sleep in the name Allah",
    "arabic": "اَللّٰهُمَّ بِاسْمِكَ أَمُوْتُ وَأَحْيَا",
    "uccharon": "Allāhumma bismika amūtu wa aḥyā.",
    "meaning":"O Allah, solely in Your Name I die and I live."
  }
]