[
  {
    "id": 1,
    "name": "Istifta",
    "arabic": "سُبْحَانَكَ اللّٰهُمَّ وَبِحَمْدِكَ ، وَتَبَارَكَ اسْمُكَ ، وَتَعَالَىٰ جَدُّكَ ، وَلاَ إِلٰهَ غَيْرُكَ",
    "uccharon": "Subḥānaka Allāhumma wa bi-ḥamdika wa tabāraka-smuka wa taʿālā jadduka wa lā ilāha ghayruk.",
    "meaning": "How Perfect are You O Allah, and all praise is Yours. Your Name is most blessed, Your majesty is exalted and there is no god worthy of worship except You."
  },
  {
    "id": 2,
    "name": "Istiftah",
    "arabic": "اَللّٰهُمَّ بَاعِدْ بَيْنِـيْ وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ ، اَللّٰهُمَّ نَقِّنِيْ مِنَ الْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَالدَّنَسِ، اَللّٰهُمَّ اغْسِلْ خَطَايَاىَ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ",
    "uccharon": "Allāhumma bāʿid baynī wa bayna khaṭāyāya kamā bāʿadta bayna-l-mashriqi wa-l-maghrib, Allāhumma naq-qinī min khaṭāyāya kamā yunaq-qa-th-thawbul-abyaḍu mina-d-danas, Allāhumma-ghsilnī min khaṭāyāya bil-māi’ wa-th-thalji wal-barad.",
    "meaning": "O Allah, distance me from my sins as You have distanced the East from the West. O Allah purify me from my sins as white cloth is purified from dirt. O Allah wash away my sins with water, hail and snow."
  },
  {
    "id": 3,
    "name": "Istiftah",
    "arabic": "اَلْحَمْدُ لِلّٰهِ حَمْدًا كَثِيْرًا طَيِّبًا مُّبَارَكًا فِيْهِ",
    "uccharon": "Alḥamdu li-llāh ḥamdan kathīran ṭayyiban mubārakan fīh.",
    "meaning": "All praise is for Allah; an abundant, sincere and blessed praise."
  },
  {
    "id": 4,
    "name": "Istiftah",
    "arabic": "اَللّٰهُ أَكْبَرُ كَبِيْرًا ، وَالْحَمْدُ لِلّٰهِ كَثِيْرًا ، وَسُبْحَانَ اللّٰهِ بُكْرَةً وَّأَصِيْلًا",
    "uccharon": "Allahu akbaru kabira walhamdu li-llah kathira, wa subhana-allahi bukaratan wa asila",
    "meaning": "Allah is greater the greatest: abundant praise is for Allah, and how Perfect is Allah in the morning and the evening."
  },
  {
    "id": 5,
    "name": "Istiftah",
    "arabic": "سُبْحَانَ اللّٰهِ رَبِّ الْعَالَمِيْنَ ، سُبْحَانَ اللّٰهِ وَبِحَمْدِهِ",
    "uccharon": "Subḥānallāhi Rabbi-l-ālamin, subḥānallāhi wa bi-ḥamdih.",
    "meaning": "Allah is free from imperfection, the Lord of all the worlds. Allah is free from imperfection, and all praise is due to Him."
  },
  {
    "id": 6,
    "name": "Istiʿādhah",
    "arabic": "أَعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
    "uccharon": "Aʿūdhu bi-llāhi mina-sh-Shayṭāni-r-rajīm.",
    "meaning": "I seek protection in Allah from the rejected Shayṭān."
  },
  {
    "id": 7,
    "name": "Istiʿādhah ",
    "arabic": "أَعُوْذُ بِاللّٰهِ السَّمِيْعِ الْعَلِيْمِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ",
    "uccharon": "Aʿūdhu bi-llāhi-s-Samīʿi-l-ʿAlīm mina-sh-Shayṭāni-r-rajīm, min hamzihī wa nafkhihī wa nafthih.",
    "meaning": "I seek protection in Allah, the All-Hearing and All-Knowing from the rejected Shaytān; from him inciting madness, pride and reprehensible poetry."
  },
  {
    "id": 8,
    "name": "Rukū",
    "arabic": "سُبْحَانَ رَبِّـيَ الْعَظِيْمِ",
    "uccharon": "Subḥāna Rabiyya-l-ʿAẓīm.",
    "meaning": "How perfect is my Lord, the Magnificent."
  },
  {
    "id": 9,
    "name": "Rukū",
    "arabic": "سُبْحَانَ ذِي الْجَبَرُوْتِ ، والْمَلَكُوْتِ ، والْكِبْرِيَاءِ ، والْعَظَمَةِ",
    "uccharon": "Subḥāna dhi-l-jabarūt, wa-l-malakūt, wa-l kibriyā’, wa-l-ʿaẓamah.",
    "meaning": "How perfect is the Owner of might, dominion, grandeur and greatness!"
  },
  {
  "id": 10,
  "name": "Rukū",
  "arabic": "اَللّٰهُمَّ لَكَ رَكَعْتُ ، وَبِكَ اٰمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِيْ ، وَبَصَرِيْ ، وَمُخِّيْ ، وَعَظْمِيْ ، وَعَصَبِيْ",
  "uccharon": "Allāhumma laka rakʿatu, wa bika āmantu, wa laka aslamtu, khashʿa laka samʿī, wa baṣarī, wa mukhkhī, wa aẓmī, wa aṣabī.",
  "meaning":"O Allah, for You Alone I have bowed in prayer, in You Alone I have believed, and to You Alone I have submitted. My hearing, sight, mind, bones and nerves are humble to You."
},
{
    "id": 11,
    "name": "Rukū",
    "arabic": "سُبُّوْحٌ، قُدُّوْسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوْحِ",
    "uccharon": "Subbūḥun, Quddūsun, Rabbul-malā’ikati wa-r-rūḥ.",
    "meaning":"The Supremely Perfect, The Most Pure, The Lord of the Angels and the Spirit (Jibrīl)."
  }
]
