import React from "react";

function Donation() {
  return (
    <div className="bg-[#F7F3DE] text-[#2e424d] px-[100px] py-10 text-xl">
      <h1 className="bg-[#98dad9] text-center py-5 rounded-md font-bold text-2xl">
        আমাদের সমর্থন করুন
      </h1>
      <p className="text-xl mt-10">
        আসসালামুয়ালাইকুম ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু, আপনার দৃষ্টি
        আকর্ষণ করার জন্য, আমি একাই সাইটটি পরিচালনা ও সংগঠিত করছি। সাইটটি চালু
        রাখার জন্য, আমি সবাইকে আমাদের সাইটের জন্য তহবিল দেওয়ার জন্য অনুরোধ
        করছি! ইন শা আল্লাহ এটাকে সাদকাহে জারিয়াতে গণনা করা হবে এবং সবাই এর জন্য
        প্রচুর পুরস্কৃতও হবে… এবং আল্লাহ আমাকে এই ওয়েবসাইটটির জন্য আমার
        সর্বাত্মক প্রচেষ্টা চালানোর শক্তি দান করুন যাতে সারা বিশ্বে ইসলামিক
        জ্ঞান ছড়িয়ে পড়ে… অনুগ্রহ করে দান করুন নীচে দেওয়া তথ্য -
      </p>
      <div className="py-10 space-y-5">
        <h1 className="text-start text-2xl font-bold">
          কিভাবে অনুদান ব্যবহার করা হবে?
        </h1>
        <p>
          বিশ্বস্ত পথে, আমাদের দৃষ্টিভঙ্গি হল মুসলিম সম্প্রদায়ের জন্য একটি
          দীর্ঘস্থায়ী এবং প্রভাবশালী সংস্থান তৈরি করা, যেখানে যে কেউ ইসলাম
          সম্পর্কে তাদের বোঝাপড়া গভীর করতে এবং তাদের বিশ্বাসকে শক্তিশালী করতে
          আসতে পারে। যাইহোক, এই ধরনের একটি প্ল্যাটফর্ম বজায় রাখা এবং বৃদ্ধির
          জন্য চলমান প্রচেষ্টা এবং সংস্থান প্রয়োজন।
        </p>
        <p>
          ওয়েবসাইট রক্ষণাবেক্ষণ একটি নির্বিঘ্ন, ব্যবহারকারী-বান্ধব অভিজ্ঞতা
          প্রদানের জন্য অত্যন্ত গুরুত্বপূর্ণ। আপনার সমর্থনের মাধ্যমে, আমরা
          নিশ্চিত করতে পারি যে সাইটটি দ্রুত, সুরক্ষিত এবং সর্বদা অ্যাক্সেসযোগ্য
          থাকে। তহবিল নির্ভরযোগ্য হোস্টিংয়ের খরচ কভার করতে সাহায্য করে,
          ব্যবহারকারীর ডেটা সুরক্ষিত রাখতে দৃঢ় নিরাপত্তা ব্যবস্থা প্রয়োগ করে
          এবং আমাদের সাইটের অবকাঠামো ক্রমাগত আপডেট করার অনুমতি দেয়, যাতে এটি
          সমস্ত ডিভাইসে মসৃণভাবে চলে।
        </p>
        <p>
          রক্ষণাবেক্ষণের বাইরে, বিশ্বস্ত পথ-এ উপলব্ধ বিষয়বস্তু সম্প্রসারণের
          জন্য আমাদের দৃঢ় প্রতিশ্রুতি রয়েছে। আমরা এই প্ল্যাটফর্মটিকে ইসলামিক
          জ্ঞানের জন্য একটি ব্যাপক কেন্দ্রে পরিণত করে আমাদের সম্পদকে সমৃদ্ধ করার
          লক্ষ্য রাখি। অনুদান আমাদের নতুন নিবন্ধ, ব্লগ এবং শিক্ষামূলক সামগ্রী
          তৈরি করতে সক্ষম করে যা বিস্তৃত বিষয় কভার করে। আমরা মাল্টিমিডিয়া
          বিষয়বস্তু যেমন অডিও বক্তৃতা এবং ভিডিও টিউটোরিয়াল, বিভিন্ন শেখার
          পছন্দগুলি পূরণ করতে আকাঙ্ক্ষা করি। উপরন্তু, আপনার অবদান আমাদের তাফসীর
          এবং হাদিস ভাষ্যের ভাণ্ডার প্রসারিত করতে সাহায্য করবে, ব্যবহারকারীদের
          জন্য ইসলামী শিক্ষার গভীরে প্রবেশ করা সহজ করে তুলবে।
        </p>
        <p>
          শিক্ষা আমাদের মিশনের কেন্দ্রবিন্দুতে। আমরা বয়স বা পটভূমি নির্বিশেষে
          সকলকে উচ্চ মানের ইসলামী শিক্ষা প্রদান করতে চাই। আপনার অনুদানের
          সাহায্যে, আমরা কুরআন অধ্যয়ন, হাদিস, ফিকাহ এবং আরও অনেক কিছুর উপর
          বিনামূল্যে অনলাইন কোর্স বিকাশ করতে এবং অফার করতে পারি, নিশ্চিত করে যে
          ইসলামী জ্ঞান সবার কাছে অ্যাক্সেসযোগ্য। আমরা শিশুদের জন্য আকর্ষক
          বিষয়বস্তু তৈরি করার পরিকল্পনাও করেছি, যাতে তাদের জন্য ইসলাম সম্পর্কে
          জানা সহজ এবং মজাদার হয়। উপরন্তু, আপনার সমর্থন আমাদেরকে পণ্ডিতদের সাথে
          লাইভ ওয়েবিনার এবং প্রশ্নোত্তর সেশনগুলি হোস্ট করার অনুমতি দেবে,
          ব্যবহারকারীদের বিশেষজ্ঞদের সাথে সরাসরি জড়িত হওয়ার এবং তাদের
          বোঝাপড়ার সুযোগ প্রদান করবে।
        </p>
        <p>
          আপনার অবদান এই দৃষ্টিভঙ্গি অর্জনে একটি গুরুত্বপূর্ণ ভূমিকা পালন করে।
          অনুদানের মাধ্যমে, আপনি ইসলামিক জ্ঞান ও মূল্যবোধ ছড়িয়ে দেওয়ার জন্য
          নিবেদিত একটি প্ল্যাটফর্মের বৃদ্ধি এবং স্থায়িত্বকে সরাসরি সমর্থন
          করছেন। একসাথে, আমরা এমন একটি সংস্থান তৈরি করতে পারি যা সমগ্র উম্মাহকে
          উপকৃত করে, সারা বিশ্বের মুসলমানদের নির্দেশনা, শিক্ষা এবং অনুপ্রেরণা
          প্রদান করে।
        </p>
      </div>
      <div className="pb-10 space-y-5">
        <h1 className="text-start text-2xl font-bold py-10">
          কিভাবে আপনার অনুদান একটি পার্থক্য করে?
        </h1>
        <p>
          বিশ্বস্ত পথে, আপনার অনুদান সরাসরি আমাদের মিশনকে সমর্থন করে এবং ইসলামিক
          জ্ঞান ও শিক্ষা ছড়িয়ে দিতে একটি বিশাল ভূমিকা রাখে। এই অনুদানের
          মাধ্যমে আমরা আমাদের ওয়েবসাইটটি বজায় রাখতে পারি, যাতে এটি সবসময়
          দ্রুত, নিরাপদ, এবং ব্যবহারকারীর জন্য সুবিধাজনক থাকে। এটি আমাদের নতুন
          বিষয়বস্তু তৈরি করতে সহায়তা করে, যাতে আমরা আরও ইসলামিক প্রবন্ধ, ব্লগ,
          এবং শিক্ষা উপকরণ যুক্ত করতে পারি। আপনার সমর্থনের মাধ্যমে আমরা শিশুদের
          জন্য আকর্ষণীয় বিষয়বস্তু তৈরি করতে পারি এবং ফ্রি অনলাইন কোর্স প্রদান
          করতে পারি, যা যেকোনো বয়সের মুসলিমদের জন্য ইসলামিক শিক্ষা সহজলভ্য করে
          তোলে।
        </p>
        <p>
          অন্যদিকে, আপনার অনুদান আমাদের লাইভ ওয়েবিনার এবং প্রশ্নোত্তর সেশনের
          মতো বিশেষ উদ্যোগগুলি পরিচালনা করতে সহায়তা করে, যেখানে ব্যবহারকারীরা
          সরাসরি বিশেষজ্ঞদের সাথে সংযুক্ত হতে পারে এবং তাদের ইসলামিক জ্ঞানকে আরও
          গভীর করতে পারে। এই অনুদানগুলি আমাদের ওয়েবসাইটকে আরও উন্নত করতে এবং
          সম্প্রসারিত করতে সহায়তা করে, যাতে বিশ্বস্ত পথ একটি সম্পূর্ণ ইসলামিক
          রিসোর্স হয়ে ওঠে।
        </p>
        <p>
          আমাদের এই উদ্যোগে আপনার অংশগ্রহণ শুধুমাত্র একটি ওয়েবসাইটকে সমর্থন করে
          না, বরং এটি ইসলামিক জ্ঞান ছড়িয়ে দিতে একটি গুরুত্বপূর্ণ ভূমিকা পালন
          করে, যা পুরো উম্মাহর জন্য উপকারী। আপনার অনুদান একটি চলমান সদকাহ (সদকাহ
          জারিয়াহ) হিসেবে গণ্য হবে, যা আপনাকে এই জীবনে এবং পরকালে অশেষ পুরস্কার
          এনে দেবে।
        </p>
      </div>
      <div className="pb-10 space-y-5">
        <h1 className="text-start text-2xl font-bold py-10">
          জাযাকাল্লাহু খাইরান
        </h1>
        <p>
          আপনার অনুদান আমাদের জন্য অমূল্য। বড় হোক বা ছোট, প্রতিটি অবদানকে আমরা
          সমানভাবে মূল্যায়ন করি এবং কৃতজ্ঞতার সাথে গ্রহণ করি। আপনার এই সহায়তা
          আমাদেরকে বিশ্বস্ত পথ-এর মাধ্যমে ইসলামিক শিক্ষা ছড়িয়ে দিতে এবং আরও
          মানুষের কাছে পৌঁছাতে সাহায্য করে।
        </p>
      </div>
      <h1 className="text-center font-bold text-4xl my-10">আলহামদুলিল্লাহ</h1>
    </div>
  );
}

export default Donation;
