import React from "react";

function Tayammum() {
  return (
    <>
      <div>
        <h1 className="text-xl font-bold mb-5">তায়াম্মুমে ৩ ফরয</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। নিয়ত করা।</p>
          <p>২। সম্পূর্ণ মুখমণ্ডল একবার মাসাহ্ করা।</p>
          <p>৩। উভয় হাত কুনইসহ একবার মাসাহ্ করা।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">
          উযু ও তায়াম্মুম ভঙ্গের কারণ ৭টি
        </h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। পায়খানা বা পেশাবের রাস্তা দিয়ে কোন কিছু বের হওয়া।</p>
          <p>২। মুখ ভরে বমি হওয়া।</p>
          <p>
            ৩। শরীরের ক্ষতস্থান হতে রক্ত, পুঁজ বা পানি বের হয়ে গড়িয়ে পড়া।
          </p>
          <p>৪। থুথুর সঙ্গে রক্তের ভাগ সমান বা বেশি হওয়া।</p>
          <p>৫। চিত হয়ে, কাত হয়ে বা হেলান দিয়ে ঘুমিয়ে যাওয়া।</p>
          <p>৬। পাগল, মাতাল ও অচেতন হওয়া।</p>
          <p>৭। নামাযে উচ্চঃস্বরে হাসা।</p>
        </div>
      </div>
    </>
  );
}

export default Tayammum;
