import React from "react";

function Parents() {
  const parents = [
    {
      id: 1,
      name: "দুলা ও দুলহানকে দু’আ",
      arabic:
        "بَارَكَ اللهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِىْ خَيْرٍ.",
      bangla:
        "বাারকাল্লাাহু লাকা ওয়া বাা রাকা ‘আলাইকা ওয়া জামা‘আ বাইনাকুমাা ফী খইর।",
      meaning:
        "আল্লাহ পাক তোমাকে বরকতপূর্ণ করুন এবং তোমার উপর বরকত অবতীর্ণ করুন এবং তোমাদের উভয়কে মঙ্গলময় সম্পর্ক দান করুন।",
    },
    {
      id: 2,
      name: "স্ত্রীর সাথে প্রথম সাক্ষাতের সময় তার কপালে হাত রেখে দু’আ",
      arabic:
        "اَللّٰهُمَّ اِنِّيْ اَسْئَلُكَ مِنْ خَيْرِهَا وَخَيْرِ مَا جَبَلْتَ عَلَيْهِ . وَاَعُوْذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَ عَلَيْهِ.",
      bangla:
        " আল্লাাহুম্মা ইন্নী আস আলুকা মিন খইরি হাা ওয়া খইরি মাা জাবালতা ‘আলাইহি ওয়া আ‘ঊযুবিকা মিন শাররি হাা ওয়া শাররি মাা জাবালতা ‘আলাইহি।",
      meaning:
        "হে আল্লাহ! আমি আপনার নিকট এ বিবির কল্যাণ এবং যে কল্যাণের উপর তাকে সৃষ্টি করেছেন, তা প্রার্থনা করছি এবং বিবির অনিষ্টতা এবং যে অনিষ্টতার উপর তাকে সৃষ্টি করেছেন তা থেকে পানাহ চাচ্ছি।",
    },
    {
      id: 3,
      name: "সহবাসের পূর্বে দু’আ",
      arabic:
        "بِسْمِ اللّٰهِ اَللّٰهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا.",
      bangla:
        "বিসমিল্লাাহি আল্লাাহুম্মা জান্নিবনাাশ শাইত্বাানা ওয়া জান্নিবিশ শাইত্বাানা মাা রযাক্বতানাা।",
      meaning:
        " আল্লাহর নামের সাথে শুরু করছি। হে আল্লাহ! আপনি আমাদেরকে শয়তান হতে রক্ষা করুন এবং আপনি আমাদেরকে যে সন্তান দান করবেন তাকে শয়তান হতে রক্ষা করুন।",
    },
    {
      id: 4,
      name: " বীর্যপাতের সময় (মনে মনে)",
      arabic:
        "اَللّٰهُمَّ لَا تَجْعَلْ لِلشَّيْطَانِ فِيْمَا رَزَقْتَنَا نَصِيْبًا.",
      bangla:
        "আল্লাাহুম্মা লাা তাজ‘আল লিশ শাইত্বাানি ফী মাা রযাক্বতানাা নাসীবাা।",
      meaning:
        "হে আল্লাহ! আপনি আমাদেরকে যে সন্তান দান করবেন তাতে শয়তানের কোনো অংশ রাখবেন না।",
    },
    {
      id: 5,
      name: " অনুগত সন্তান প্রার্থনা",
      arabic:
        "رَبِّ ہَبۡ لِیۡ مِنۡ لَّدُنۡکَ ذُرِّیَّۃً طَیِّبَۃً ۚ اِنَّکَ سَمِیۡعُ الدُّعَآءِ",
      bangla:
        "রাব্বি হাবলী মিল্লাদুনকা যুররিইয়াতান ত্বইয়্যিবাতান, ইন্নাকা সামি’উদ দু’য়া-ই।",
      meaning:
        "হে, রব! আমাকে তুমি তোমার নিকট হতে নেক বংশধর দান কর। নিশ্চয়ই তুমি প্রার্থনা শ্রবণকারী।",
    },
    {
      id: 6,
      name: "সন্তানের জন্য দু’আ",
      arabic:
        "رَبِّ اجْـعَـلْـنِـىْ مُـقِـيْـمَ الصَّـلـوةِ وَمِـنْ ذُرِّيَّـتِـىْ ق رَبَّـنَـا وَتَـقَـبَّـلْ دُعَـاءِ",
      bangla:
        "রাব্বিজা’আল্‌নি মুক্বীমাস সালা-তি ওয়া মিন্ যুররিয়্যাতী, রাব্বানা ওয়া তাক্বাব্বাল দু’আ।",
      meaning:
        "হে আমার প্রতিপালক! আমাকে সালাত কায়েমকারী কর এবং আমার বংশধরদের মধ্য হতেও। প্রভু হে! আমার প্রার্থনা মঞ্জুর কর।",
    },
    {
      id: 7,
      name: " পিতা-মাতার জন্য দু’আ",
      arabic: "رَبِّ ارْحَـمْـهُـمَـا  كَـمَـا رَبَّيَانِي صَـغِـيْـرًا",
      bangla: "রব্বির হাম্‌ হুমা কামা রব্বা ইয়ানি সগিরা",
      meaning:
        " হে আমাদের প্রতিপালক! তাদের উভয়ের (পিতা-মাতার) প্রতি দয়া কর যেভাবে শৈশবে তারা আমাকে প্রতিপালন করেছিলেন।",
    },
    {
      id: 8,
      name: " শিশুর জন্য দোআ",
      arabic: "اَللّٰهُمَّ أَلْقِهِ الْحِكْمَةَ وَالْعِلْمَ وَالْبَرَكَةْ",
      bangla: "আল্লাহুম্মা আলকিহিল হিকমাতা, অল এলমা অলবারাকাত।",
      meaning: "হে আল্লাহ আপনি তাকে হেকমত,জ্ঞান এবং বরকত দান করুন।",
    },
  ];
  return (
    <div className="relative text-xl bg-[#e8e9f3] text-[#2e424d] px-[100px] py-10">
      <h1 className="bg-[#98dad9] text-center py-5 my-10 rounded-md font-bold text-xl">
      পিতামাতা-সংসার-সন্তান
      </h1>{" "}
      <ul className="space-y-2">
        {parents.map((data, id) => (
          <li
            key={id}
            className="space-y-3 p-4 border border-[#a6a6a8] rounded-lg"
          >
            <h1 className="text-xl font-bold mb-2 mt-2">{data.name}</h1>
            <div className="border-[1px] border-[#98dad9]"></div>
            <p className="text-center font-bold py-5">{data.arabic}</p>
            <p>
              <span className="font-bold">উচ্চারণঃ </span>
              {data.bangla}
            </p>
            <p>
              <span className="font-bold">অর্থঃ </span>
              {data.meaning}
            </p>
          </li>
        ))}
      </ul>
    </div>
  );
}

export default Parents;
