import React from "react";

function Society() {
  const society = [
    {
      id: 1,
      name: "কোনো মুসলমানের সাথে সাক্ষাত হলে",
      arabic: "السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ",
      bangla: "আস্‌সালামু আলাইকুম ওয়ারাহ্‌মাতুল্লাহি ওয়াবারাকাতুহ।",
      meaning: "আপনার উপর শান্তি ও আল্লাহ পাকের রহমত ও বরকত বর্ষিত হোক।",
    },
    {
      id: 2,
      name: "সালামের উত্তরে",
      arabic: "وَعَلَيْكُمُ السَّلَامُ وَرَحْمَةُ اللهِ وَبَرَكَاتُهٗ",
      bangla: "ওয়া আলাইকুমুস্‌ সালাম ওয়ারাহ্‌মাতুল্লাহি ওয়াবারাকাতুহ।",
      meaning: "এবং আপনার উপরেও শান্তি ও আল্লাহ পাকের রহমত ও বরকত বর্ষিত হোক।",
    },
    {
      id: 3,
      name: "মুসাফাহা করার দু’আ",
      arabic: "يَغْفِرُ اللهُ لَنَا وَ لَكُمْ",
      bangla: "ইয়াগফিরুল্লাাহু লানাা ওয়া লাকুম।",
      meaning: "আল্লাহ তা’আলা আমাদেরকেও ক্ষমা করুন এবং আপনাদেরকেও ক্ষমা করুন।",
    },
    {
      id: 4,
      name: "হাঁচি দিলে",
      arabic: "الْحَمْدُ لِلَّهِ",
      bangla: " আলহামদুলিল্লাহ্‌",
      meaning: "সকল প্রশংসা আল্লাহর!",
    },
    {
      id: 5,
      name: "কেউ উপকার করলে তাঁর জন্যে এই বলে দু’আ ",
      arabic: "جَزَاكَ اللّٰهُ خَيْرًا",
      bangla: "জাযাকাল্লাহু খাইরান।",
      meaning: "আল্লাহ তা’আলা আপনাকে উত্তম প্রতিদান দান করুন।",
    },
    {
      id: 6,
      name: "কাউকে বিদায় দেয়ার সময়",
      arabic:
        "اَسْتَوْدِ عُ اللهَ دِيْنَكُمْ وَاَمَانَتَكُمْ وَخَوَاتِيْمَ اَعْمَالِكُمْ.",
      bangla:
        "আস্তাউদি‘উল্লাাহা দী নাকুম ওয়া আমাা নাতাকুম ওয়া খওয়াা তীমা আ’মাালিকুম।",
      meaning:
        "তোমার দ্বীন-ঈমানকে এবং তোমার আমানতদারীকে এবং তোমার হোসনে খাতিমাকে (ঈমানের উপর মৃত্যু) আল্লাহ তা’আলার হাতে সোপর্দ করছি।",
    },
    {
      id: 7,
      name: "কাউকে হাসিমুখে দেখলে",
      arabic: "اَضْحَكَ اللّٰهُ سِنَّكَ",
      bangla: "আয হাকাল্লাাহু সিন্নাকা।",
      meaning: "আল্লাহ পাক আপনাকে চির হাসিমুখ রাখুন।",
    },
    {
      id: 8,
      name: "কারো থেকে বিদায় নেয়ার সময়",
      arabic: "اَسْتَوْدِعُكُمُ اللهَ الَّذِيْ لَا تَضِيْعُ وَدَائِعُهٗ",
      bangla: "আস্তাউদি‘উ কুমুল্লাা হাললাযী লাা তাযী‘উ ওয়াদাা ই ‘উহূ।",
      meaning:
        "আমি তোমাকে এমন সত্তার কাছে আমানত রেখে যাচ্ছি, যিনি তার আমানত কখনও নষ্ট করেন না।",
    },
  ];
  return (
    <div className="relative text-xl bg-[#e8e9f3] text-[#2e424d] px-[100px] py-10">
      <h1 className="bg-[#98dad9] text-center py-5 my-10 rounded-md font-bold text-xl">
        সামাজিকতা
      </h1>
      <ul className="space-y-2">
        {society.map((data, id) => (
          <li
            key={id}
            className="space-y-3 p-4 border border-[#a6a6a8] rounded-lg"
          >
            <h1 className="text-xl font-bold mb-2 mt-2">{data.name}</h1>
            <div className="border-[1px] border-[#98dad9]"></div>
            <p className="text-center font-bold py-5">{data.arabic}</p>
            <p>
              <span className="font-bold">উচ্চারণঃ </span>
              {data.bangla}
            </p>
            <p>
              <span className="font-bold">অর্থঃ </span>
              {data.meaning}
            </p>
          </li>
        ))}
      </ul>
    </div>
  );
}

export default Society;
