import React from "react";

function RojaNaVangarKaron() {
  return (
    <div className="relative text-xl bg-[#f8ebd5] text-[#2e424d] px-[100px] py-10 space-y-5">
      <h1 className="bg-[#e49733] text-[#2e424d] text-center py-5 my-10 rounded-md font-bold text-2xl
">
      যে সব কারণে রোযা ভঙ্গ হয় না
      </h1>
      <p>
        রোযা অবস্থায় প্রয়োজনবশত: ইনজেকশন বা স্যালাইন পুশ করা জায়িয আছে। এমনকি
        প্রয়োজনে গ্লুকোজ সাল্যাইনও পুশ করা যাবে। এর দ্বারা রোযার কোন ক্ষতি হবে
        না। কোন ঔষধ ব্যতীত যদি শুধু অক্সিজেন নেয়া হয় তাহলেও রোযা ভাঙ্গবে না। -
        জাদীদ ফিকহী মাসাঈল:১ম খন্ড,১৮৮ পৃ:
      </p>
      <p>
        নিজের কোন রোগের কারণে, বা অন্য রোগীর অপারেশন বা অন্য কোন প্রয়োজনে রোযা
        অবস্থায় ইনজেকশনের মাধ্যমে রক্ত বের করাতে রোযার কোন ক্ষতি হবে না এবং
        প্রয়োজনে রক্ত গ্রহণ করাতেও রোযার কোন ক্ষতি হবে না। - আহসানুল ফাতওয়া:৪র্থ
        খন্ড, ৪২৫ পৃ:
      </p>
      <p>
        রোযাদার দিনের বেলায় প্রয়োজনে চোখে ঔষধ দিতে পারে। এতে রোযার কোন ক্ষতি হবে
        না। ঔষধ চাই তরল জাতীয় হোক এমনিভাবে সুরমাও দিতে পারবে। এসব বিষয়ে রোযার
        কোন ক্ষতি হবে না। যদিও ঔষধ বা সুরমার স্বাদ গলায় অনুভূত হয় না কেন। বা
        থু-থুর সাথে তা দৃষ্টিগোচর হয় না কেন। - হিদায়া: ১ম খন্ড,২০১ পৃ:, আলবাহরুর
        রায়েক:২য় খন্ড, ৪৭৬ পৃ:
      </p>
      <p>
        রোযা অবস্থায় দিনের বেলায়ও মা তার দুগ্ধপোষ্য সন্তানকে দুধ পান করাতে
        পারবে। এর দ্বারা রোযার কোন ক্ষতি হবে না। এমনিভাবে এর দ্বারা অযুও ভাঙ্গবে
        না। - ফাতওয়ায়ে দারুল উলুম দেওবন্দ:৬ষ্ঠ খন্ড,৪০৮-৪১১ পৃ:)
      </p>
      <p>
        স্বামী যদি তরকারীতে লবণ কম-বেশি হলে বা মসল্লা ঠিকমত না হলে গাল-মন্দ করে,
        মারপিট করে, তাহলে জিহবা দিয়ে তরকারীর লবণ দেখা যেতে পারে। তবে সতর্ক থাকতে
        হবে যেন ভিতরে চলে না যায়। বরং জিহবায় দিয়ে সাথে সাথে থুথু করে ফেলে দিবে।
        রোযা অবস্থায় মুখের থু-থু অথবা সর্দির কারণে নাকের পানিও শ্লেস্মা উপরের
        দিকে টান দেয়ার কারণে যদি গলায় এসে যায় আর রোযাদার তা গিলে ফেলে তাহলে এর
        দ্বারা রোযার কোন ক্ষতি হবে না। - আলবাহরুর রায়েক: ২য় খন্ড, ৪৭৭ পৃ:
      </p>
      <p>
        কুলি করার পর মুখে যেই সিক্ততা বাকি থাকে থু-থুর সাথে তা গিলে ফেললে রোযার
        কোন ক্ষতি হবে না। - ফাতওয়ায়ে আলমগীরী: ১ম খন্ড, ২০৩ পৃ:
      </p>
      <p>
        রোযা অবস্থায় মাথায় বা শরীরে তেল ব্যবহার করা জায়িয। এতে রোযার কোন ক্ষতি
        হবে না। বিধায় এই মাসআলার উপর ভিত্তি করে বলা যায় যে, রোযা অবস্থায় স্নো
        ক্রিম, পাউডার ও লোশন জাতীয় প্রসাধনী ব্যবহার করা যাবে এতে রোযার কোন ক্ষতি
        হবে না। তবে প্রসাধনীতেই যদি নাপাক বা ব্যবহার করা যায় না এমন কোন মেডিসিন
        থাকে তাহলে ভিন্ন কথা। তাহলে তা রোযা ছাড়া অন্য অবস্থায়ও ব্যবহার করা যাবে
        না। - ফাতওয়া শামী :৩য় খন্ড,৩৬৬ পৃ:
      </p>
      <p>
        রোযা অবস্থায় দিনের যে কোন সময়ে গাছের ডাল দিয়ে মিসওয়াক করা যাবে, এতে
        রোযার কোন ক্ষতি হবে না। অনেকে মনে করে রোযা অবস্থায় আসরের পূর্বে মিসওয়াক
        করা যায় না। এটি একটি ভুল ধারণা । নিম গাছ, জয়তুন গাছ সহ আরো অন্যান্য
        গাছের ভিজা ডাল দিয়েও মিসওয়াক করা যাবে। মিসওযাক করার সময় যদি ডালের আশ
        গলায় চলে যায় তাহলে এর দ্বারা রোযার কোন ক্ষতি হবে না। রোযা অবস্থায় টুথ
        পেষ্ট বা টুথ পাউডার অথবা কয়লা ইত্যাদি দিয়ে দাঁত পরিস্কার করা মাকরূহ।
        দিনের বেলায় এসব ব্যবহার থেকে বিরত থাকতে হবে। তবে যদি একান্ত প্রয়োজন হয়
        যেমন এগুলো ব্যবহার না করলে দাঁতের ব্যথা হয় বা দাঁতের গোড়া ফুলে যায় তাহলে
        প্রয়োজনের কারণে ব্যবহার করতে পারবে তবে এ অবস্থায়ও সতর্কতা অবলম্বন করতে
        হবে যাতে গলায় চলে না যায়। যদি সামান্য একটুও গলায় চলে যায় তাহলে রোযা
        ভেঙ্গে যাবে। - জাদীদ ফিকহী মাসাইল: ১ম খন্ড,১৮৮ পৃ:
      </p>
      <p>
        রোযা অবস্থায় যদি কারো অনিচ্ছায় বমি হয় তাহলে রোযার কোন ক্ষতি হবে না। তার
        পরিমাণ বেশি বা কম হোক । আর যদি ইচ্ছাকৃত বমি করে এবং তা মুখ ভরে হয় তাহলে
        রোযা ভেঙ্গে যাবে। মুখ না ভরলে রোযা ভাঙ্গবে না। বমি আসার পর যদি তা নিজে
        নিজেই আবার ভেতরে চলে যায় তাহলেও রোযা ভাঙ্গবে না। হ্যাঁ ইচ্ছা করে যদি
        বমিতে নির্গত খাদ্য খেয়ে ফেলে বা গিলে ফেলে এবং ছোলা পরিমাণ হয় তাহলে রোযা
        ভেঙ্গে যাবে। - ফাতওয়া শামী:৩য় খন্ড,৩৯২পৃ:
      </p>
      <p>
        কোন ব্যক্তি সুবহে সাদিকের পূর্বে যদি সঙ্গম করার পর ঘুমিয়ে যায়- আর সুবহে
        সাদিকের পর ঘুম থেকে উঠে অথবা দিনের কিয়দাংশ নাপাক অবস্থায় থাকে বা পুরো
        দিন নাপাক অবস্থায় থাকে অথবা দিনের বেলায় নাইট প্রেসার-স্বপ্নদোষ হয় তাহলে
        এসবের দ্বারা রোযার কোন ক্ষতি হবে না। রোযা আদায় হয়ে যাবে। বাকি নাপাক
        অবস্থায় থাকাটা গোনাহের কাজ । তাছাড়া দিনের নামাযগুলো পড়ার জন্য তো গোসল
        করতেই হেব। তাই যথাসম্ভব তাড়াতাড়ি গোসল করতে হবে। তবে এই গোসল করা না করার
        সাথে রোযার বিশেষ সম্পর্ক নেই । - ফাতওয়ায়ে আলমগীরী:১ম খন্ড,২০৬ পৃ:
      </p>
      <p>
        কোন ব্যক্তি সফরের নিয়তের দিনের বেলায় ঘর থেকে বের হওয়া পর্যন্ত ঐ দিনের
        রোযা ভাঙ্গা তার জন্য জায়িয নেই, রোযা ভেঙ্গে এরপর রওয়ানা করে তাহলে তার
        উপর ঐ রোযার কাযা কাফফারা উভয়টি আবশ্যক হয়ে যাবে। - ফাতওয়ায়ে আলমগীরী:১ম
        খন্ড,২০৬ পৃ:
      </p>
      <p>
        রোযা অবস্থায় অজু করার সময় গড়গড়া করা, নাকের ভিতর পানি টেনে নেয়া মাকরুহ। -
        আলমগীরী : ১ম খন্ড, ১৯৯ পৃৃ:
      </p>
    </div>
  );
}

export default RojaNaVangarKaron;
