import React from "react";

function Fazael() {
  return (
    <div>
      <h1>ফাযায়েল</h1>
      <h3>ইশরাকের ফাযায়েলঃ</h3>
      <p>
        ১। হযরত মুআয ইবনে আনাস জুহানী (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ
        (ﷺ) এরশাদ করিয়াছেন, যে ব্যক্তি ফজরের নামাজ শেষ করিয়া উক্ত জায়গায় বসিয়া
        থাকে, ভালো কথা ছাড়া কোন কথা না বলে। অতঃপর দুই রাকাত ইশরাকের নামায পড়ে
        তাহার গুনাহ মাফ হইয়া যায়, যদিও তাহা সমুদ্রের ফেনা হইতে অধিক হয়। (আবু
        দাউদ)
      </p>
      <p>
        ২। হযরত হাসান ইবনে আলী রাযিঃ বলেন, আমি নবী করীম (ﷺ) কে এই এরশাদ করিতে
        শুনিয়াছি যে, যে ব্যক্তি ফজরের নামাজ পড়িয়া সূর্যোদয় পর্যন্ত আল্লাহ
        তায়ালার যিকিরে মশগুল থাকে। অতঃপর দুই অথবা চার রাকাত (এশরাকের নামায) পড়ে
        দোযখের আগুন তাহার চামড়া (ও) স্পর্শ করিবে না। (বায়হাকী)
      </p>
      <p>
        ৩। হযরত আনাস ইবনে মালেক (রাযিঃ) বর্ণনা করেন যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, যে ব্যক্তি ফজরের নামাজ জামাতের সহিত আদায় করে। অতঃপর সূর্যোদয়
        পর্যন্ত আল্লাহ তায়ালার যিকিরে মশগুল থাকে, তারপর দুই রাকাত নফল পড়ে তবে সে
        হজ্জ ও ওমরার সওয়াব লাভ করে। হযরত আনাস (রাযিঃ) বলেন, নবী করিম রাসূলুল্লাহ
        (ﷺ) তিনবার এরশাদ করিয়াছেন, পরিপূর্ণ হজ্জ ও ওমরার সওয়াব, পরিপূর্ণ হজ্জ ও
        ওমরার সওয়াব, পরিপূর্ণ হজ্জ ও ওমরার সওয়াব লাভ করে। (তিরমিযী)
      </p>
      <p>
        ৪। হযরত আবু দারদা (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, আল্লাহ তায়ালা বলেন, হে আদমের সন্তান, দিনের শুরুতে চার রাকাত
        পড়িতে অক্ষম হইও না আমি তোমার সারা দিনের কাজ সম্পন্ন করিয়া দিব। (মুসনাদে
        আহমাদ, মাজমায়ে যাওয়ায়েদ)
      </p>
      <p>
        ৫। হযরত আবু হোরায়রা (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ (ﷺ) একটি
        বাহিনী পাঠাইলেন। যাহারা অতি অল্প সময়ে সমস্ত গনীমতের মাল লইয়া ফিরিয়া
        আসিল। একজন সাহাবী (রাযিঃ) আরজ করিলেন, ইয়া রাসূলাল্লাহ, আমরা এমন বাহিনী
        দেখি নাই যাহারা অতি অল্প সময়ে সমস্ত গনীমতের মাল লইয়া ফিরিয়া আসিয়াছে।
        রাসূলুল্লাহ (ﷺ) এরশাদ করিলেন, আমি কি তোমাদিগকে ইহা অপেক্ষা কম সময়ে এই
        গনীমতের মাল হইতে অধিক গনীমত অর্জনকারী ব্যক্তির কথা বলিব না! সে ঐ ব্যক্তি
        যে নিজের ঘর হইতে উত্তমরূপে অযূ করিয়া মসজিদে যায়, ফজরের নামাজ পড়ে। অতঃপর
        (সূর্যোদয়ের পর) এশরাকের নামায পড়ে। এই ব্যক্তি অতি অল্প সময়ে অনেক বেশী
        মুনাফা উপার্জনকারী। (আবু ইয়ালা, মাজমায়ে যাওয়ায়েদ)
      </p>
      <h3>চাশতের ফাযায়েলঃ</h3>
      <p>
        ১। হযরত আবু যার (রাযিঃ) হইতে বর্ণিত আছে যে, নবী করিম (ﷺ) এরশাদ করিয়াছেন,
        তোমাদের প্রত্যেক ব্যক্তির উপর অবশ্য কর্তব্য যে, তাহার শরীরের প্রত্যেকটি
        জোড়ের সুস্থতার শোকরস্বরূপ প্রত্যহ একটি করিয়া সদকা করে। প্রতিবার
        সুবহানাল্লাহ বলা সদকা। প্রতিবার আলহামদুলিল্লাহ বলা সদকা, প্রতিবার
        লা-ইলাহা ইল্লাল্লাহ বলা সদকা, প্রতিবার আল্লাহু আকবার বলা সদকা, ভালো
        কাজের হুকুম করা সদকা, অন্যায় কাজ হইতে বাধা প্রদান করা সদকা এবং প্রত্যেক
        জোড়ের শোকর আদায়ের জন্য চাশতের সময় দুই রাকাত পড়া যথেষ্ট হইয়া যায়।
        (মুসলিম)
      </p>
      <p>
        ২। হযরত বুরাইদাহ (রাযিঃ) বলেন, আমি রাসূলুল্লাহ (ﷺ)কে এই এরশাদ করিতে
        শুনিয়াছি যে, মানুষের মধ্যে তিনশত ষাটটি জোড় আছে। তাহার উপর অবশ্য কর্তব্য
        যে, প্রত্যেক জোড়ের সুস্থতার শোকরস্বরূপ একটি করিয়া সদকা আদায় করে। সাহাবা
        (রাযিঃ) আরজ করিলেন, ইয়া রাসূলাল্লাহ, এত সদকা কে আদায় করিতে পারে? এরশাদ
        করিলেন, মসজিদে যদি থুথু পড়িয়া থাকে তাবে উহাকে মাটি দ্বারা ঢাকিয়া দেওয়া
        সদকার সওয়াব রাখে, রাস্তা হইতে কষ্টদায়ক জিনিস সরাইয়া দেওয়াও সদকা, যদি
        এইসব কাজের সুযোগ না পায়, তবে তোমাদের জন্য এই সকল সদকার বিনিময়ে চাশতের
        দুই রাকাত নামাজ পড়া যথেষ্ট হইবে। (আবু দাউদ)
      </p>
      <p>
        ৩। হযরত আবু হোরায়রা (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, যে চাশতের দুই রাকাত পড়ার এহতেমাম করে তাহার গুনাহ মাফ করিয়া
        দেওয়া হয় যদিও তাহা সমুদ্রের ফেনা সমতুল্য হয়। (ইবনে মাজাহ)
      </p>
      <p>
        ৪। হযরত আবু দারদা (রাযিঃ) বর্ণনা করেন যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, যে ব্যক্তি চাশতের দুই রাকাত নফল পড়ে সে আল্লাহ তায়ালার এবাদত
        হইতে গাফেল ব্যক্তিদের মধ্যে গণ্য হয়না। যে চার রাকাত নফল পড়ে তাহাকে
        এবাদাতগুজারদের মধ্যে লেখা হয়। যে ছয় রাকাত নফল পড়ে তাহাকে সেই দিনের
        কাজকর্মে সাহায্য করা হয়। যে আট রাকাত নফল পড়ে আল্লাহ তায়ালা তাহাকে অনুগত
        বান্দাদের মধ্যে লিখিয়া দেন, আর যে বার রাকাত নফল পড়ে আল্লাহ তায়ালা তাহার
        জন্য জান্নাতে মহল তৈয়ার করিয়া দেন। প্রত্যেক দিনে ও রাত্রে আল্লাহ তায়ালা
        আপন বান্দাগণের উপর সদকা ও এহসান করিতে থাকেন। আর আপন বান্দার উপর আল্লাহ
        তায়ালার সবচেয়ে বড় এহসান এই যে, তাহাকে যিকিরের তৌফিক দান করেন। (তাবাবানী,
        মাজয়াবে যাওয়ায়েদ)
      </p>
      <h1>আউয়াবীনের ফাযায়েলঃ</h1>
      <p>
        {" "}
        হযরত আবু হোরায়রা (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, যে ব্যক্তি মাগরিবের নামাযের পর ছয় রাকাত এইভাবে পড়ে যে, উহার
        মাঝে কোন অনর্থক কথা না বলেতবে তাহার বার বৎসর এবাদতের সমপরিমাণ সওয়াব লাভ
        হয়। (তিরমিযী)
      </p>
      <h1>তাহাজ্জুদের ফাযায়েলঃ</h1>
      <p>
        ১। হযরত আবু হোরায়রা (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, যে ব্যক্তি কোন রাত্রে নামাযের মধ্যে একশত আয়াত পড়ে, সে ঐ রাত্রে
        আল্লাহর এবাদত হইতে গাফেল ব্যক্তিদের মধ্যে গণ্য হয়না, আর যে ব্যক্তি কোন
        রাত্রে নামাযের মধ্যে দুইশত আয়াত পড়ে, সে ঐ রাত্রে এখলাসের সহিত
        এবাদতকারীদের মধ্যে গণ্য হয়। (মুসতাদরাকে হাকেম)
      </p>
      <p>
        ২। ইবনে আবদুল্লাহ ইবনে আমর ইবনে আস (রাযিঃ) বর্ণনা করেন যে, রাসূলুল্লাহ
        (ﷺ) এরশাদ করিয়াছেন, যে ব্যক্তি তাহাজ্জুদে দশ আয়াত পড়িয়া লয় সে ঐ রাত্রে
        গাফেলীনদের মধ্যে গণ্য হয়না। যে একশত আয়াত পড়িয়া লয় সে এবাদতগুজারদের মধ্যে
        গণ্য হয়। আর যে একহাজার আয়াত পড়িয়া লয় সে ঐ সকল লোকদের মধ্যে গণ্য হয়
        যাহারা কিনতার পরিমাণ সওয়াব লাভ করে। (ইবনে খুযাইমা)
      </p>
      <p>
        ৩। হযরত আবু হোরায়রা (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, বার হাজার উকিয়াতে এক কিনতার হয় এবং প্রত্যেক উকিয়া জমিন আসমানের
        মধ্যবর্তী সমুদয় জিনিস হইতে উত্তম। (ইবনে হিব্বান)
      </p>
      <p>
        ৪। হযরত আবু হোরায়রা (রাযিঃ) হইতে বর্ণিত আছে যে, রাসূলুল্লাহ (ﷺ) এরশাদ
        করিয়াছেন, আল্লাহ তায়ালা সেই ব্যক্তির উপর রহমত নাযিল করুন, যে রাত্রে
        উঠিয়া তাহাজ্জুদ পড়ে, অতঃপর নিজ স্ত্রীকেও জাগ্রত করে এবং সেও নামাজ পড়ে।
        আর যদি (ঘুমের আধিক্যের দরুন) সে না উঠে তবে তাহার মুখের উপর হালকা পানির
        ছিটা দিয়া জাগ্রত করে। এমনিভাবে আল্লাহ তায়ালা সেই মহিলার উপর রহমত নাযিল
        করুন, যে রাত্রে উঠিয়া তাহাজ্জুদ পড়ে, অতঃপর নিজ স্বামীকে জাগ্রত করে এবং
        সেও নামাজ পড়ে। আর যদি সে না উঠে তবে তাহার মুখের উপর হালকা পানির ছিটা
        দিয়া উঠাইয়া দেয়। (নাসাঈ)
      </p>
    </div>
  );
}

export default Fazael;
