import React from "react";

function MohiladerNamaj() {
  return (
    <div>
      <h1>মহিলাদের নামায</h1>
      <h3>দাঁড়ানোতে ৭ কাজ</h3>
      <p>
        ১. পায়ের আঙ্গুলসমূহ কিবলার দিকে সোজাভাবে রাখা। ২. উভয় পায়ের মাঝখানে
        অনুর্ধ চার আঙ্গুল পরিমাণ ফাঁক রাখা। ৩. উভয় পায়ের বৃদ্ধাঙ্গুলদ্বয় ও
        গোঁড়ালীদ্বয়ের মাঝে সমান দূরত্ব রাখা। ৪. তাকবীরে তাহরীমার পূর্বে হাত
        ছেড়ে দাঁড়ানো। (হাত বেঁধে না রাখা)। ৫. সম্পূর্ণ সোজা হওয়া (এক পায়ে ভর
        দিয়ে বাঁকা হয়ে না দাঁড়ানো)। ৬. ঘাড় সোজা রাখা। চেহারা জমিনের দিকে না
        করা। ৭. সিজদার জায়গার দিকে নজর রাখা।
      </p>
      <h3>হাত উঠানোতে ৮ কাজ</h3>
      <p>
        ১. হাত কাপড়ের ভিতর রেখে উঠানো। (বাইরে বের না করা) হাত উঠানোর সময়
        জমিনের দিকে মাথা না ঝুকানো। ২. হাত উঠানোর সময় (যথাসম্ভব) হাত শরীরের
        সাথে লাগিয়ে রাখা। ৩. তাকবীরে তাহরিমার সময় হাত কাঁধ পর্যন্ত উঠানো। ৪.
        হাতের আঙ্গুলগুলো মিলিয়ে রাখা। ৫. হাতের তালু সম্পূর্ণ কিবলামুখী করে
        রাখা। ৬. তাকবীরে তাহরীমা বলার প্রাক্কালে উক্ত নামাযের খেয়াল (নিয়ত) মনে
        হাজির করা। [ফরয] ৭। হাত উঠানোর পর তাকবীরে তাহরীমা শুরু করা। তাকবীর- এর
        মাদ এক আলিফ থেকে বেশী না টানা। ৮. তাকবীরে তাহরীমা বলার পর সরাসরি বুকের
        উপর হাত রাখা। (হাত বাঁধার আগে হাত ঝুলিয়ে না দেয়া)।
      </p>
      <h3>হাত বাঁধার ৪ কাজ</h3>
      <p>
        ১. ডান হাতের তালু বাম হাতের পিঠের উপর রাখা। ২. সিনার উপর হাত রাখা। ৩.
        হাতের আঙ্গুলগুলো মিলিয়ে রাখা। ৪. উভয় বাজু বগলের সাথে মিলিয়ে রাখা।
      </p>
      <h3>হাত বাঁধার পর ৮ কাজ</h3>
      <p>
        ১. ছানা পড়া ২. আ‘উযুবিল্লাহ পড়া। ৩. বিসমিল্লাহ পড়া। ৪. সূরা ফাতিহা
        পড়া [ওয়াজিব]। ৫. সূরা ফাতিহা পড়ার পর নীরবে আমীন বলা। ৬. সূরা মিলানো
        (ফজরের প্রথম দু’রাকা‘আতে এবং ওয়াজিব, সুন্নাত ও নফলের সব ক’টি রাকা‘আতে)
        [ওয়াজিব]। ৭. সূরা এর শুরু থেকে মিলালে প্রথমে বিসমিল্লাহ পড়া। ৮. মাসনূন
        ক্বিরা‘আত পড়া।
      </p>
      <h3>রুকু অবস্থায় ১০ কাজ</h3>
      <p>
        ১. রুকু‘তে যাওয়া অবস্থায় তাকবীর বলা। ২. উভয় পায়ের গোড়ালীদ্বয়
        মিলিয়ে রাখা। ৩. রুকুতে পূর্ণ বাঁকা না হয়ে মধ্যম ধরনের ঝুঁকা। ৪. চাদরের
        ভিতর দিয়ে হাতের আঙ্গুল হাঁটু পর্যন্ত পৌঁছে দেয়া। ৫. হাতের আঙ্গুলগুলো
        মিলিয়ে রাখা। ৬. হাঁটুদ্বয় একটু বাঁকিয়ে সামনের দিকে ঝুঁকিয়ে রাখা। ৭.
        সম্পূর্ণ হাত শরীরের সাথে মিলিয়ে রাখা। ৮. পায়ের দিকে নজর রাখা। ৯.
        রুকু‘তে কমপক্ষে তিনবার রুকু‘র তাসবীহ্ (সুবহানা রাব্বিয়াল ‘আজীম) পড়া।
        ১০. রুকু‘ করা ফরয এবং রুকুতে কমপক্ষে এক তাসবীহ পরিমাণ দেরী করা ওয়াজিব।
      </p>
      <h3>রুকু থেকে উঠায় ৩ কাজ</h3>
      <p>
        ১. রুকু থেকে উঠার সময় ‘সামি‘আল্লাহু লিমান হামিদাহ্’ বলা। ২. সোজা হয়ে
        (হাত ছেড়ে) স্থিরভাবে দাঁড়ানো। [ওয়াজিব] ৩. দাঁড়িয়ে ‘রাব্বানা ওয়া
        লাকাল হামদ্’ বলা।
      </p>
      <h3>সিজদা অবস্থায় ১৯ কাজ</h3>
      <p>
        ১. সিজদায় যাওয়া অবস্থায় তাকবীর বলা। ২. হাঁটু মাটিতে লাগার আগ পর্যন্ত
        সিনা ও মাথা সোজা রাখা অবস্থায় সিজদায় যাওয়া। ৩. (প্রথমে) উভয় হাঁটু
        মাটিতে রাখা। ৪. (তারপর) নিতম্ব রাখা। ৫. উভয় পা ডান দিক দিয়ে বের করে
        বিছিয়ে রাখা। ৬. পায়ের আঙ্গুলগুলো কিবলামুখী করে রাখা। ৭. তারপর আঙ্গুল
        মিলিয়ে হাঁটুর কাছে মাথা রাখা। ৮. আঙ্গুলের মাথাগুলো কিবলামুখী করে
        সোজাভাবে রাখা। ৯. দু‘হাতের মধ্যখানে চেহারা রাখা যায় এ পরিমাণ ফাঁক রাখা।
        ১০. (তারপর) বৃদ্ধাঙ্গুলের মাথা বরাবর হাঁটুর সামনে রাখা। ১১. নাকের
        অগ্রভাগের দিকে অর্থাত জমিনের দিকে নজর রাখা। ১২. (তারপর) কপাল রাখা। ১৩.
        পেট উরুর সঙ্গে মিলিয়ে রাখা। ১৪. কনুই মাটিতে লাগিয়ে রাখা। ১৫. বাহু
        শরীরের সঙ্গে মিলিয়ে রাখা। ১৬. অত্যন্ত জড়সড় হয়ে সিজদা করা। ১৭.
        আঙ্গুলসমূহ পরস্পরে মিলিয়ে রাখা। ১৮. কমপক্ষে তিনবার সিজদার তাসবীহ্
        (সুবহানা রাব্বিয়াল আ‘লা ) পড়া। ১৯. সিজদা করা ফরয এবং সিজদায় কমপক্ষে
        এক তাসবীহ পরিমাণ দেরী করা ওয়াজিব।
      </p>
      <h3>সিজদা থেকে উঠায় ১৫ কাজ</h3>
      <p>
        ১. সিজদা থেকে উঠা অবস্থায় তাকবীর বলা। ২. (প্রথমে) কপাল উঠানো। ৩.
        (তারপর) নাক উঠানো। ৪. (তারপর) উভয় হাত উঠানো। ৫. দুই সিজদার মাঝখানে সোজা
        হয়ে স্থিরভাবে বসা। [ওয়াজিব]। ৬. উভয় পা ডান দিক দিয়ে বের করে বিছিয়ে
        রাখা। ৭. উভয় পায়ের আঙ্গুলসমূহ (সম্ভবমত) কিবলার দিকে মুড়িয়ে রাখা।
        ৮.নিতম্বের উপর বসা। ৯. উভয় হাত উরুর উপর হাতের আঙ্গুলের মাথা হাঁটু বরাবর
        রাখা। ১০. নজর দুই হাঁটুর মাঝে রাখা। ১১. বসা অবস্থায়
        দু‘আ(আল্লাহুম্মাগফিরলী) বলা। ১২. তাকবীর বলা অবস্থায় দ্বিতীয় সিজদায়
        যাওয়া। ১৩. পূর্বের নিয়মে দ্বিতীয় সিজদার পর তাকবীর বলা অবস্থায়
        পরবর্তী রাকা‘আতের জন্য পায়ের অগ্রভাগে ভর করে দাঁড়ানো। ১৪. হাঁটুর উপর
        হাত রেখে দাঁড়ানো। ১৫. সিজদা হতে সরাসরি দাঁড়ানো। (মাঝখানে না বসা) এবং
        উঠার মাঝে রুকুর অবস্থা সৃষ্টি না করা।
      </p>
      <h3>বসায় ১২ কাজ</h3>
      <p>
        ১. উভয় পা ডান দিকে বের করে বিছিয়ে বসা। ২. উভয় পায়ের আঙ্গুলসমূহ
        (সম্ভবমত) কিবলার দিকে মুড়িয়ে রাখা। ৩. উভয় হাতের আঙ্গুলসমূহ মিলিয়ে
        রাখা এবং উরুর উপর আঙ্গুলসমূহের মাথা হাঁটু বরাবর রাখা। ৪. মাথা ও পিঠ সোজা
        রাখা। ৫. নজর দুই হাঁটুর মাঝে রাখা। ৬. ‘আত্তাহিয়্যাতু’ পড়া। [ওয়াজিব]
        ৭. ‘আশহাদু’ বলার সঙ্গে সঙ্গে মধ্যমা ও বৃদ্ধাঙ্গুলির মাথা একসঙ্গে মিলিয়ে
        এবং অনামিকা ও কনিষ্ঠা আঙ্গুলদ্বয় মুড়িয়ে রেখে হালকা বাঁধা। ৮. ‘লা
        ইলাহা’ বলার সময় শাহাদাত আঙ্গুল সামান্য উঁচু করে ইশারা করা। অতঃপর
        ‘ইল্লাল্লাহু’ বলার সময় নামানো। ৯. বৈঠক শেষ হওয়া পর্যন্ত হাত ঐরূপ হালকা
        বাঁধা অবস্থায় রাখা। ১০. আখেরী বৈঠক (আত্তাহিয়্যাতুর পর) দরূদ শরীফ পড়া।
        ১২. (অতঃপর) দু‘আয়ে মাসূরা পড়া।
      </p>
      <h3>সালাম ফিরানোতে ৬ কাজ</h3>
      <p>
        ১. সালামের সময় ফেরেশতাদেরকে সালাম করার নিয়ত করা। ২. উভয় সালাম কিবলার
        দিক থেকে শুরু করা। ৩. উভয় সালামে ‘আসসালামু’ বলা পর্যন্ত চেহারা কিবলার
        দিকে রাখা। ৪. (প্রথমে) ডান দিকে, (অতঃপর) বাম দিকে সালাম ফিরানো। ৫.
        সালামের সময় ডানে-বামে শুধু চেহারা ফিরানো (সিনা না ফিরানো)। ৬. আলাইকুম
        বলার সময় নজর কাঁধের দিকে ফিরানো।
      </p>
      <h3>পুরো নামাযে ৮ মাসাইল</h3>
      <p>
        ১. নামাযের শুরু থেকে শেষ পর্যন্ত অন্তরে নামাযের খেয়াল রাখা, আর সহজ
        পদ্ধতি হল সব কিছু খেয়াল করে পড়া। মুখস্তের জোরে না পড়া। (মন অন্য কোন
        দিকে চলে গেলে, স্মরণ হওয়া মাত্রই ফিরিয়ে আনা) ২. মাঝের তাকবীরগুলো
        পূর্ববর্তী রুকন থেকে আরম্ভ করে অপর রুকনে পৌঁছে শেষ করা। (কিন্তু তাকবীর
        এক আলিফ থেকে টানা যাবে না।) ৩. এক রুকন থেকে অন্য রুকনে যেতে বিনা ওযরে
        বিলম্ব না করা। ৪. পঠিত সূরা বা দু‘আ সমূহের প্রতি অন্তরে খেয়াল করা। ৫.
        ক্বিরা‘আত, তাকবীর, দু‘আ ইত্যাদি চুপি চুপি পড়া। ৬. সর্বাবস্থায় হাতের
        আঙ্গুলসমূহ মিলিয়ে রাখা। ৭. হাই আসলে, যথাসম্ভব মুখ বন্ধ রাখতে চেষ্টা
        করা। ৮. হাঁচি আসলে সাধ্যমত দমিয়ে রাখা।
      </p>
    </div>
  );
}

export default MohiladerNamaj;
