import React from "react";

function Time() {
  return (
    <div className="space-y-5 text-xl">
      <div>
        <h1 className="text-xl font-bold mb-5">জরুরী মাসায়েল</h1>
        <p className="text-xl">
          সূর্যোদয় এবং তারপর ১৫ মিনিট, দ্বিপ্রহর এবং তার আগে পরে ৫ মিনিট করে ১০
          মিনিট এবং সূর্যাস্ত ও তার পূর্বে ১৫ মিনিট সর্বপ্রকার নামায পড়া নিষেধ।
          তবে ঐ দিনের আসরের ফরয নামায কেউ না পড়ে থাকলে সূর্যাস্তের সময়ে পড়ে
          নিবে। সুবহে সাদিক থেকে সূর্যোদয় পর্যন্ত ফজরের দুই রাকাআত সুন্নাত
          ব্যতীত অন্য কোন সুন্নাত, নফল এবং আসরের ফরয নামাযের পর থেকে সূর্যাস্ত
          পর্যন্ত সুন্নাত ও নফল নামায পড়া নিষেধ। তবে এসময় কাযা নামায ও সিজদায়ে
          তিলাওয়াত আদায় করা যায়। সূর্যোদয়ের সময় হতে কমপক্ষে ১৫ মিনিট পর ইশরাক ও
          চাশতের নামাযের সময় শুরু হয় এবং দ্বিপ্রহরের ৫ মিনিট পূর্ব পর্যন্ত উভয়
          নামাযের ওয়াক্ত থাকে। তবে ওয়াক্তের শুরুর দিকে ইশরাক ও শেষের দিকে চাশত
          পড়া উত্তম।
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5"> জরুরী জ্ঞাতব্যঃ</h1>
        <p className="mb-2">
          প্রচলিত অধিকাংশ ক্যালেন্ডারে শুধুমাত্র সাহরী বা শুধুমাত্র ফজরের আযানের
          ব্যাপারে সতর্কতা অবলম্বন করা হয়েছে যা যথেষ্ঠ নয়। আল্লাহর মেহেরবানিতে এ
          ক্যালেন্ডারে উভয়টির ব্যাপারে ৫ মিনিট করে মোট ১০ মিনিট সতর্কতা অবলম্বন
          করা হয়েছে, যা হাদীস শরীফ দ্বারা প্রমাণিত। নবী (ﷺ)-এর সাহরী শেষ করে ফজর
          শুরু করতে ৫০ আয়াত তিলাওয়াত পরিমান বিলম্ব হত। যার পরিমান আনুমানিক ১০
          মিনিট। সতর্কতামূলক সূর্যাস্তের মূল সময়ের তিন মিনিট পর মাগরিব ও ইফতারের
          সময় দেয়া হয়েছে। সুতরাং প্রদত্ত সময়েই আযান দিবে ও ইফতার করবে। বেশী
          বিলম্বের প্রয়োজন নেই। নামায রোযার সময়সূচী মূলত প্রত্যক্ষ দর্শনের উপর
          নির্ভরশীল। কিন্তু অপারগতার ক্ষেত্রে ঘড়ির টাইম ঠিক রেখে প্রণীত সময়সূচী
          অনুযায়ী আমল করা যায়।
        </p>
        <p>
          আল্লাহ তা‘আলা নামাযকে সময়ের সাথে খাস করে দিয়েছেন। প্রত্যেক নামাযের
          নির্ধারিত সময় রয়েছে। প্রত্যেক নামাযকে তার নির্ধারিত সময়ে আদায় করা ফরয।
          গ্রহণযোগ্য কোনো ওযর ছাড়া এক নামায অন্য নামাযের সময়ে আদায় করলে কবীরা
          গুনাহ হবে।
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">ফজর</h1>
        <p className="mb-2">
          সুবহে সাদিক থেকে নিয়ে সূর্য উঠার আগ পর্যন্ত ফজরের ওয়াক্ত থাকে। পূব
          আকাশের উত্তর-দক্ষিণে যখন সাদা একটা আলো ছড়ায় তখন ফজরের ওয়াক্ত হয়।
          সূর্যের কিনারা দেখা পর্যন্ত ফজরের ওয়াক্ত থাকে। ফজরের সময়ের মধ্যেও
          মাগরিবের মতো আকাশ সাদা ও লাল হয়। ফজরে প্রথমে আকাশ সাদা হয় তারপর লাল হয়
          আর মাগরিবে প্রথমে লাল হয় এরপর সাদা হয়। ফজরের সময়ও প্রায় সোয়া এক ঘণ্টা
          থেকে দেড় ঘণ্টা পর্যন্ত থাকে। (আল বাহরুর রায়েক ১/৪২৩)
        </p>
        <p className="mb-2">
          নবী (ﷺ)-এর সাহরী শেষ করে ফজর শুরু করতে ৫০ আয়াত তিলাওয়াত পরিমান বিলম্ব
          হত। যার পরিমান আনুমানিক ১০ মিনিট। (বুখারী শরীফঃ হাদীস নং-১৯২১)
        </p>
        <p>
          ফজরের সময় আলো উত্তর-দক্ষিণে ছড়িয়ে যাওয়ার পরে নবীজী (ﷺ) ফজর পড়তে
          বলেছেন। এ সময় ফজর পড়া উত্তম এবং বেশি সাওয়াব লাভের কারণ। কিন্তু রমযান
          মাসে আউয়াল ওয়াক্তে ফজর পড়ার মধ্যে বেশি সাওয়াব। (আল বাহরুর রায়েক
          ১/৪২৮-২৯)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5"> ইশরাক</h1>
        <p>
          সূর্য উঠা শুরু হওয়া থেকে নিয়ে ১৫-২০মি. পর এই নামাযের সময় শুরু হয় এবং
          দ্বিপ্রহর পর্যন্ত এর সময় থাকে। সময় হওয়ার পর পর ইশরাক পড়া ভাল। এই নামায
          নফল। দুই চার রাকা‘আত যা পারা যায় পড়া। এই নামায যে পড়ে, সারা দিনের
          সমস্ত প্রয়োজনের জন্য আল্লাহ তা‘আলা তার জন্য যথেষ্ট হয়ে যান। (আত তারগীব
          ওয়াত তারহীব, হাদীস নং-১০০৯)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">চাশত</h1>
        <p>
          ইশরাক এবং চাশতের নামাযের সময় এক। তবে বেলা এগারটার দিকে চাশতের নামায
          পড়া ভাল। চাশতের নামায সর্বোচ্চ বার রাকা‘আত। এই নামাযও নফল। (ফাতাওয়া
          হিন্দিয়া ১/১২৪)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">যাওয়াল</h1>
        <p>
          যখন যোহরের ওয়াক্ত শুরু হয় তখন সাথে সাথে যাওয়ালের ওয়াক্ত শুরু হয়।
          যাওয়ালের নামায ২-৪ রাকা‘আত। এই নামাযকে দিনের বেলার তাহাজ্জুদ বলা হয়।
          এর নেকীও তাহাজ্জুদ নামাযের মতো এবং হাদীসে এসেছে, এই সময়ে আল্লাহ
          রাব্বুল আলামীন আসমানে সব দরজা খুলে দেন। (আততারগীব ওয়াত তারহীব হাদীস
          নং- ৮৫৭,৮৫৯,৮৬২)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5"> যোহর</h1>
        <p className="mb-2">
          দ্বিপ্রহর থেকে সূর্য যখন একটু পশ্চিম দিকে হেলে যায় তখন যোহরের ওয়াক্ত
          শুরু হয়। এবং প্রতিটা জিনিসের আসল ছায়া ব্যতীত তার ছায়া দ্বিগুণ হওয়া
          পর্যন্ত যোহরের ওয়াক্ত থাকে। জুম‘আ আর যোহরের নামাযের ওয়াক্ত এক ও
          অভিন্ন। (আল বাহরুর রায়েক ১/৪২৩)
        </p>
        <p>
          শীত কালে যত তাড়াতাড়ি যোহরের নামায পড়া যায় তত ভাল। গরমের দিন এক মিছিলের
          শেষ চতুর্থাংশে পড়া ভাল। তবে জুম‘আর নামায সব মৌসুমে আউয়াল ওয়াক্তে পড়া
          উত্তম। (আল বাহরুর রায়েক ১/৪২৯)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">জুম‘আর নামায</h1>
        <p className="mb-2">
          জুম‘আর নামায মোট ১২ (বার) রাকা‘আত। কাবলাল জুম‘আ চার রাকা‘আত, ফরয দুই
          রাকা‘আত, বা‘দাল জুম‘আ চার রাকআত, ওয়াক্তিয়া সুন্নাত দুই রাকা‘আত। কোনো
          কোনো বড় গ্রামে এখনও আখেরী যোহর বা এহতিয়াতি যোহর পড়ে, এগুলি জায়েয নেই।
          বাংলাদেশের বড় গ্রামগুলো শহরের হুকুমে। সেখানে আখেরী যোহর পড়লে গুনাহ
          হবে। হ্যাঁ, এখনো যদি কোনো অজপাড়া থাকে যেখানে নিত্য প্রয়োজনীয় সব জিনিস
          পাওয়া যায় না, রাস্তা ঘাট নেই, দোকান পাট নেই, কম সংখ্যক লোক ব্যবসা করে
          তাহলে তারা জুম‘আ ও ঈদ পড়বে না। সেখানে ভুলক্রমে জুম‘আ পড়ে ফেললে চার
          রাকা‘আত ইহতিয়াতি যোহর পড়ে নিবে।
        </p>
        <p>
          যখন যোহরের সময় হবে তখন সাথে সাথে আযান হবে এবং তখনই মসজিদে রওনা করা
          জরুরী হয়ে যাবে। তিনটি জিনিস এক সাথে হবে: ১. ওয়াক্ত হওয়া ২. আযান হওয়া
          ৩. মসজিদে রওনা হওয়া। তারপর ১৫/২০ মিনিট বা সর্বোচ্চ আধা ঘণ্টা বয়ান
          হবে। বয়ান চলাকালীন যাদের উযূ প্রয়োজন তারা উযূ করে নিবে। বয়ান শেষে
          জুম‘আর দ্বিতীয় আযান হবে। আযান শেষ হলে খুতবা। তারপর ফরয নামায হবে।
          সাধারণত শীতকালে দিন ছোট হওয়ার কারণে একটু আগে ওয়াক্ত শুরু হয়ে যায়।
          সর্বোচ্চ দুপুর সোয়া একটা থেকে দেড়টার মধ্যে পুরো নামায শেষ হয়ে যাবে।
          যেহেতু জুম‘আর আগে বয়ানের জন্য দীর্ঘ সময় পাওয়া যায় না তাই নামায শেষে
          পুনরায় দীনী বয়ান বা মাসআলা মাসায়েলের আলোচনা হতে পারে।
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">আসর</h1>
        <p className="mb-2">
          যোহরের নামাযের ওয়াক্ত শেষ হওয়ার সাথে সাথে আসারের নামাযের ওয়াক্ত শুরু
          হয়ে যায়। এর মাঝখানে কোনো বিরতী নেই। সূর্য অস্ত যাওয়ার পূর্ব পর্যন্ত
          আসরের ওয়াক্ত থাকে। তবে সূর্য ডুবার ১৫ মিনিট আগ পর্যন্ত উত্তম সময়। ।
          (আল বাহরুর রায়েক ১/৪২৫)
        </p>
        <p className="mb-2">
          সূর্য অস্ত যাওয়ার ১৫ মি. আগ থেকে মাকরূহ সময় শুরু হয়ে যায়। এই সময় নামায
          পড়লে নামায আদায় হয়ে যাবে কিন্তু মাকরূহ হবে। ইচ্ছা করে এই সময়ে নামায
          পড়লে গুনাহ হবে। আর যদি এমন হয় যে, কেউ ঐ দিনের আসরের নামায আদায় করেনি
          ইতিমধ্যে সূর্য ডুবে যাচ্ছে তাহলে তাকে ঐ সময়ই আসর পড়তে হবে। কিন্তু এটা
          মাকরূহে তাহরীমা হবে। তবে ফরজের যিম্মাদারি আদায় হয়ে যাবে। । (আল বাহরুর
          রায়েক ১/৪৩৫)
        </p>
        <p>
          আসর সবসময় দেরি করে পড়া ভালো। কেননা আসরের পরে কোনো নফল পড়া যায় না।
          সুতরাং আসরের সময় হওয়ার প্রায় আধাঘণ্টা বা পোনে এক ঘণ্টা পরে আসর পড়বে।
          যাতে আসরের আগে বেশি করে নফল পড়া যায়। (আল বাহরুর রায়েক ১/৪২৯)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">মাগরিব</h1>
        <p className="mb-2">
          বেলা (সূর্য) সম্পূর্ণ ডুবে যাওয়ার সাথে সাথে মাগরিবের নামাযের ওয়াক্ত
          এবং ইফতারের ওয়াক্ত শুরু হয়ে যায়। (ইফতার দেরি করে করা মাকরূহ) মাগরিবের
          ওয়াক্ত শুরু হওয়ার সাথে সাথে আযান ইকামাত দিয়ে নামায আদায় করা উত্তম।
          পশ্চিম আকাশ বেশ কিছু সময় লালিমা থাকে, এই লালিমা শেষ হওয়ার পর একটু সাদা
          ভাব হয়। সাদা ভাব শেষ হওয়ার পর আকাশ কালো হতে শুরু করে। আকাশ কালো হওয়ার
          আগ পর্যন্ত মাগরিবের ওয়াক্ত থাকে। অর্থাৎ আকাশের অবস্থা যতক্ষণ লাল ও
          সাদা মিশ্রিত থাকে ততক্ষণ মাগরিবের ওয়াক্ত থাকে। মাগরিবের সময় প্রায় সোয়া
          এক ঘণ্টা থেকে দেড় ঘণ্টা পর্যন্ত থাকে। আমাদের দেশের অনেকে মনে করে
          মাগরিবের সময় ১৫-২০ মি. থাকে। যার কারণে এই সময়ের ভিতর মাগরিব পড়তে না
          পারলে আর পড়ে না। মনে করে কাযা যখন হয়ে গেল তখন পরে এক সময় পড়ে নিব। অথচ
          সোয়া এক ঘণ্টা থেকে দেড় ঘণ্টার মধ্যে নামায পড়লেও আদায় হয়ে যাবে। কোনো
          ইমামের মতে লাল শেষ হয়ে সাদা শুরু হওয়ার সাথে সাথে মাগরিবের ওয়াক্ত শেষ
          হয়ে ইশার ওয়াক্ত শুরু হয়ে যায়। আমাদের হানাফী মাযহাবে এ মতের উপর ফাতাওয়া
          নয়। তাই একান্ত ঠেকা ছাড়া ঐ সময়ে ইশা পড়বে না। (আল বাহরুর রায়েক
          ১/৪২৫-২৬)
        </p>
        <p>
          মাগরিব নামায ওয়াক্ত হওয়ার সাথে সাথে পড়া উত্তম। কিন্তু রমযান মাসে একটু
          দেরি করে পড়তে বলা হয়েছে। যাতে আগে ইফতার করে নেয়া যায়। কারণ আগে ইফতার
          করতে পারলে নামায খুশু-খুযুর সাথে হবে। (আল বাহরুর রায়েক ১/৪৩১)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5"> আউয়াবীন</h1>
        <p>
          মাগরিবের ফরযের পর এই নামায। মাগরিবের দুই রাকা‘আত সুন্নাত ছাড়া ছয়
          রাকা‘আত পড়তে পারলে উত্তম। তবে মাগরিবের দুই রাকা‘আত সুন্নাতসহ পড়লেও
          হবে। (গুনইয়াতুল মুতামালি পৃ.৪৩০)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5"> ইশা</h1>
        <p className="mb-2">
          মাগরিবের ওয়াক্ত শেষ হওয়ার সাথে সাথে ইশার ওয়াক্ত শুরু হয়ে যায়। ইশার
          ওয়াক্ত ফজরের ওয়াক্ত শুরু হওয়ার আগ পর্যন্ত থাকে। তথা সাহরীর ওয়াক্ত শেষ
          হওয়ার আগ পর্যন্ত থাকে। [অর্ধ রজনীর পূর্বেই ইশার নামাজ অবশ্যই পড়ে
          নেয়া চাই] (আল বাহরুর রায়েক ১/)
        </p>
        <p>
          রাতের এক তৃতীয়াংশের শেষের দিকে ইশা পড়া উত্তম। অর্থাৎ ইশার সময় হওয়ার
          সোয়া এক থেকে দেড় ঘণ্টা পরে ইশা পড়া উত্তম। (আল বাহরুর রায়েক ১/৪৩০)
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">তাহাজ্জুদ</h1>
        <p>
          এই নামায রাতে ঘুম থেকে উঠে পড়তে হয়। উত্তম হলো শেষ রাতে পড়া। নবীজী (ﷺ)
          যখন পূর্ণ সুস্থ ছিলেন তখন আট রাকা‘আত পড়তেন। যখন একটু বয়স বাড়লো তখন ছয়
          রাকা‘আত পড়তেন। যখন আরো বয়স বাড়লো, শরীর ভারী হয়ে গেল তখন চার রাকা‘আত
          পড়তেন। এই নামায ৪-৮ রাকা‘আত পড়তে হয়। এই নামায পড়ার জন্য ইশার নামায পড়ে
          তাড়াতাড়ি ঘুমিয়ে গেলে ভালো হয়।
        </p>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5"> নামাযের মাকরূহ ওয়াক্ত</h1>
        <div className="space-y-2">
          <p>১. সূর্য উঠার সময়।</p>
          <p>
            ২. সূর্য যখন মাথার ঠিক উপরে থাকে তখন। (ক্যালেন্ডারে দ্বিপ্রহর বলে এই
            সময়কে বুঝানো হয়)
          </p>
          <p>
            ৩. সূর্য অস্ত যাওয়ার সময়। তবে ঐদিনের আসর না পড়ে থাকলে এই মাকরূহ
            ওয়াক্তে পড়া যাবে। (আল বাহরুর রায়েক ১/৪৩২-৩৩)
          </p>
        </div>
      </div>
    </div>
  );
}

export default Time;
