import React from "react";

function RojaVangarKaron() {
  return (
    <div className="relative text-xl bg-[#F7F3DE] text-[#2e424d] px-[100px] py-10 space-y-5">
      <h1 className="bg-[#98dad9] text-center py-5 my-10 rounded-md font-bold text-xl">
      যে সমস্ত কারণে রোযা ভেঙ্গে যায়
      </h1>
      <p>
        রোযা অবস্থায় পানাহার ও যৌনাচার থেকে বিরত থাকা জরুরি, সুতরাং যদি কোন
        ব্যক্তি দিনের বেলায় ইচ্ছা করে উপরোল্লিখিত তিনটি কাজের যে কোন একটি কাজ
        করে তাহলে তার রোযা ভেঙ্গে যাবে। এবং তার উপর কাযা ও কাফ্ফারা উভয়টি ওয়াজিব
        হবে। - আলবাহরুর রায়েক:২য় খন্ড,৪৮২পৃ:
      </p>
      <p>
        সুবহে সাদিক না হওয়ার পূর্ণ ধারণার উপর কেউ সেহরী খেল অথচ তখন সুবহে সাদিক
        হয়ে গেছে ( সেহরী খাওয়ার সময় শেষ হয়ে গেছে) অথবা সূর্য অস্তমিত হওয়ার পূর্ণ
        ধারণায় ইফতার করল অথচ বাস্তবে তখনও সূর্য অস্ত যায়নি, এমতাবস্থায় তাকে ঐ
        রোযাটির কাযা করতে হবে। তবে কাফ্ফারা ওয়াজিব হবে না। পক্ষান্তরে সুবহে
        সাদিক হয়ে যাওয়ার প্রবল ধারণা থাকা সত্ত্বেও যদি কেউ সেহরী খেয়ে নেয় আর
        বাস্তবেও সুবহে সাদিক হয়ে থাকে, তাহলে তার কাযা ওয়াজিব হবে, আর যদি সূর্য
        অস্ত না যাওয়ার প্রবল ধারণা সত্ত্বেও ইফতার করে নেয় আর বাস্তব দেখা যায়
        সূর্য অস্ত যায়নি তাহলে তার কাযা কাফ্ফারা উভয়টি ওয়াজিব হবে। - ফাতওয়ায়ে
        ফাতওয়া শামী ৩য় খন্ড, ৪৮০ পৃ:
      </p>
      <p>
        সুবহে সাদিক হয়নি এই সংবাদ পেয়ে কোন ব্যক্তি খানা খেল, কিন্তু পরবর্তীতে
        তার খবর ভুল বলে প্রমাণিত হলে তার ঐ রোযার কাযা করতে হবে, কাফ্ফারা দিতে
        হবে না। - আলবাহরুর রায়েক: ২য় খন্ড, ৪৮৩ পৃ:
      </p>
      <p>
        সূর্য অস্ত চলে গেছে, ইফতারির সময় হয়েছে-দুই ব্যক্তির এই খবরের ভিত্তিতে
        রোযাদার ইফতার করল। কিন্তু অপর দুই ব্যক্তি বলল: না, এখনও ইফতারির সময়
        হয়নি। পরবর্তীতে দেখা গেল আসলেই ইফতারির সময় হয়নি-সূর্য অস্ত যায়নি। তাহলে
        ঐ রোযাদারকে রোযার কাযা করতে হবে, তবে কাফ্ফারা ওয়াজিব হবে না। - ফাতওয়ায়ে
        ফাতওয়া শামী, ৩য় খন্ড, ৩৮২ পৃ:
      </p>
      <p>
        যদি কেউ রোযা রাখার কথা ভুলে গিয়ে পানাহার করে, তাহলে তার রোযা ভাঙ্গবে না।
        তার রোযা বহাল থাকবে। তবে কেউ স্মরণ করিয়ে দেওয়ার পরও যদি খায় তাহলে রোযা
        ভেঙ্গে যাবে এবং কাযা ওয়াজিব হবে, তবে কাফ্ফারা ওয়াজিব হবেনা। - মুসলিম
        শরীফ ১ম খন্ড,৩৬৪ পৃ:, বুখারী ১ম খন্ড,২৫৯ পৃ:, ফাতহুল ক্বাদীর: ২য়
        খন্ড,২৫৪ পৃ:, ফাতওয়া শামী : ৩য় খন্ড,৩৬৫ পৃ:
      </p>
      <p>
        কোন ব্যক্তি ভুলে আহার শুরু করার পর যদি রোযার কথা স্মরণ হয় তাহলে সাথে
        সাথে মুখে যা আছে – তা ফেলে দিতে হবে। যা পেটে চলে গেছে তা বের করার অনর্থক
        চেষ্টা করার দরকার নেই। কিন্তু স্বরণ হওয়ার পর যদি মুখের লোকমাটা খেয়ে ফেলে
        তাহলে তার রোযা ভেঙ্গে যাবে এবং কাযা করতে হবে । - ফাতওয়ায়ে আলমগীরী : ১ম
        খন্ড,২০৩ পৃ:
      </p>
      <p>
        রোযা অবস্থায় নাকে অথবা পায়খানার রাস্তা দিয়ে ঔষধ প্রবিষ্ট করালে অথবা কানে
        তেল বা ঔষধ দিলে রোযা ভেঙ্গে যাবে এবং কাযা করা ওয়াজিব হবে,তবে কাফ্ফারা
        ওয়াজিব হবে না। - আলবাহরুর রায়েক: ২য় খন্ড,৪৮৬ পৃ:
      </p>
      <p>
        রোযা অবস্থায় যদি রোযাদার কানে পানি দেয় তাহলে তার রোযা ভেঙ্গে যাবে এবং
        কাযা ওয়াজিব হবে। আর যদি গোসলের সময় অনিচ্ছায় পানি প্রবেশ করে তাহলে রোযা
        ভাঙ্গবে না। - ফাতহুল কাদীর : ২য় খন্ড, ৪৮৭ পৃ:
      </p>
      <p>
        লোবান ইত্যাদির ধোঁয়া নাক দিয়ে গ্রহণ করলে রোযা ভেঙ্গে যাবে। অনুরূপ রোযা
        রাখা অবস্থায় বিড়ি, সিগারেট ও হুক্কা পান করা যাবে না। বিড়ি-সিগারেট,
        হুক্কা পান করলেও রোযা ভেঙ্গে যাবে এবং কাযা ও কাফফারা উভয়টি ওয়াজীব হবে।
        - ফাতওয়ায়ে দারুল উলূম দেওবন্দ: ৬ষ্ঠ খন্ড, ৪১৫ পৃ:
      </p>
      <p>
        দাঁতের ফাকে আটকে থাকা খাদ্য বস্তু একটি ছোলার সমপরিমাণ বা তদপেক্ষা বেশি
        হলে তা খাওয়ার দ্বারা রোযা ভেঙ্গে যাবে। এবং শুধু কাযা ওয়াজিব হবে, কাফফারা
        নয়। আর বস্তুটি ছোলার সমপরিমাণ থেকে যদি কম হয় তাহলে তা খাওয়ার দ্বারা রোযা
        ভঙ্গ হবে না। তবে যদি সেই কম পরিমাণটা মুখ থেকে বের করার পর আবার মুখে দিয়ে
        খেয়ে ফেলে তাহলে রোযা ভেঙ্গে যাবে এবং ঐ রোযার কাযা ওয়াজিব হবে, কাফ্ফারা
        নয়। - ফাতওয়ায়ে আলমগীরী : ১ম খন্ড, ২০২পৃ:
      </p>
      <p>
        যদি দাঁতের গোড়া হতে নির্গত রক্ত থু-থুর সাথে গিলে ফেলে ,আর থু-থুর অপেক্ষা
        রক্তের পরিমাণ বেশি হয় এবং রক্তের স্বাদ ও অনুভূত হয় তাহলে রোযা ভেঙ্গে
        যাবে এবং কাযা ওয়াজিব হবে। আর যদি থুথুর পরিমাণ বেশি হয় তাহলে রোযা নষ্ট
        হবে না। - আলবাহরুর রায়েক: ২য় খন্ড,৪৬৮ পৃ:
      </p>
      <p>
        রোযা অবস্থায় পান তামাক চাবানো ও গুল ব্যবহার করা যাবে না, এর দ্বারা রোযা
        ভেঙ্গে যাবে। কেননা পান চাবানোর পর তার কিছু অংশ এবং থুথুর সাথে তার রস
        গলায় চলে যাওয়ার প্রবল আশংকা রয়েছে এবং সেই উদ্দেশ্যেই পান তামাক চাবানো ও
        গুল ব্যবহার করা হয়। সুতারাং পান-তামাক ও গুল ব্যবহার করলে রোযা ভেঙ্গে
        যাবে। - ফাতওয়ায়ে দারুল উলুম দেওবন্দ:৬ষ্ঠ খন্ড,৪০৪ পৃ:
      </p>
      <p>
        কুলি করার সময় বা নাকে পানি দেওয়ার সময় যদি আকস্মাৎ গলায় পানি চলে যায় আর
        রোযার কথা স্মরণ থাকে তাহলে রোযা ভেঙ্গে যাবে এবং শুধু কাযা ওয়াজিব হবে। -
        ফাতওয়ায়ে আলমগীরী ১ম খন্ড,১০১ পৃ:
      </p>
      <p>
        রোযা অবস্থায় পাথরের টুকরা,মাটি ইত্যাদি অখাদ্য বস্তু খেয়ে ফেললে রোযা ভঙ্গ
        হয়ে যাবে এবং শুধু কাযা ওয়াজিব হবে, কাফ্ফারা নয়। অবশ্য কোন ব্যক্তি যদি
        এসব বস্তু খেতে অভ্যস্ত থাকে এবং খায় অথবা যদি কেউ এগুলো - ফাতওয়ায়ে ফাতওয়া
        শামী:৩য় খন্ড,৩৭৬পৃ
      </p>
      <p>
        স্বামী -স্ত্রী উভয়ের ইচ্ছায় রোযা অবস্থায় যদি সহবাস করে তাহলে উভয় জনের
        রোযা ভেঙ্গে যাবে। এবং উভয়ের উপর কাযা ও কাফ্ফারা উভয়টি ওয়াজিব হবে। আর যদি
        স্ত্রীর অনিচ্ছায় স্বামী জোর পূর্বক সঙ্গম করে তাহলে স্বামীর উপর কাযা
        কাফফারা উভয়টি আবশ্যক হবে। আর স্ত্রীর উপর শুধু কাযা ও ওয়াজিব হবে,
        কাফ্ফারা নয়। আর যদি স্বামীর অনিচ্ছা থাকা সত্ত্বেও স্ত্রী পক্ষ থেকে বাধ্য
        হয়ে সঙ্গম করে তাহলে স্ত্রীর উপর কাযা ও কাফ্ফারা উভয়টি ওয়াজিব হবে আর
        স্বামীর উপর শুধু কাযা ওয়াজিব হেব। - ফাতওয়ায়ে আলমগীরী ১ম খন্ড,২০৬ পৃ:
      </p>
      <p>
        রোযা অবস্থায় স্ত্রীকে চুম্বন করা, আলিঙ্গন করা, আদর সোহাগ করা বা একের
        যৌনাঙ্গ অপরের যৌনাঙ্গকে সম্পর্শ করার ফলে যদি বীর্যপাত হয়ে যায় তাহলে রোযা
        ভেঙ্গে যাবে। তবে এর দ্বারা কাফফারা ওয়াজিব হবে না, শুধু কাযা ওয়াজিব হবে।
        - (ফাতওয়ায়ে ফাতওয়া শামী : ৩য় খন্ড,৩৭৮পৃ:
      </p>
      <p>
        ইনহিলার এর মাধ্যমে পেটে ঔষধ পৌছানো হয় তার পরিমান একে বারে অল্প হওয়া
        সত্বেও ইচ্ছাকৃত ভাবে তা ব্যবহারের কারণে রোযা ভেঙ্গে যাবে, এটাই সাভাবিক
        মাসয়ালা। কিন্তু এই ঔষধ ভেতরে গিয়ে গ্যাসে পরিনত হয় না খাওয়ার আগে গ্যাসে
        পরিণত হয় এব্যাপারে ডাক্তারদের দ্বিমত রয়েছে। বিধায় সর্তকতা ও উত্তম হলো
        এমন রোগী রোযা রাখবে এবং নিজ সামর্থ হিসাবে প্রত্যেক রোযার ফিদিয়াও দিয়ে
        দিবে, যাতে রোযা না হলে ফেদিয়া দ্বারা তার দ্বায়িত্ব আদায় হয়ে যায়। আর যদি
        সম্ভব হয় তাহলে দিনের বেলায় তা ব্যবহার না করে শুধু রাতে ব্যবহার করা আরো
        ভাল। - কিতাবুল ফাতওয়া ৩য় খন্ড, ৩৯৩ পৃষ্ঠা
      </p>
    </div>
  );
}

export default RojaVangarKaron;
