import React from "react";

function PakPobitrota() {
  return (
    <div className="text-[#2e424d]">
      <h1 className="font-bold">উযু</h1>
      <h3>উযুতে ৪ ফরয</h3>
      <p>১। সম্পূর্ণ মুখ ধোয়া।</p>
      <p>২। উভয় হাত কনুইসহ ধোয়া।</p>
      <p>৩। মাথার এক চতুর্থাংশ মাসাহ্ করা।</p>
      <p>৪। উভয় পা টাখনুসহ ধোয়া।</p>
      <h3>উযু করার (সুন্নাত) তরীকা</h3>
      <p>১। উযুর নিয়ত করা।</p>
      <p>২। বিসমিল্লাহ পড়া।</p>
      <p>৩। উভয় হাত কব্জিসহ তিনবার ধোয়া।</p>
      <p>৪। মিস্ওয়াক করা।</p>
      <p>৫। তিনবার কুলি করা।</p>
      <p>৬। তিনবার নাকে পানি দেয়া ও নাক ঝাড়া।</p>
      <p>৭। সম্পূর্ণ মুখ তিনবার ধোয়া। </p>
      <p>৮। ডান হাত কনুইসহ তিনবার ধোয়া।</p>
      <p>৯। বাম হাত কনুইসহ তিনবার ধোয়া।</p>
      <p>১০। উভয় হাতের আঙ্গুলগুলো খিলাল করা। </p>
      <p>১১। সম্পূর্ণ মাথা একবার মাসাহ্ করা।</p>
      <p>১২। উভয় কান একবার মাসাহ করা।</p>
      <p>১৩। ঘাড় মাসাহ্ করা।</p>
      <p>১৪। ডান পা টাখনুসহ তিনবার ধোয়া।</p>
      <p>১৫। বাম পা টাখনুসহ তিনবার ধোয়া।</p>
      <p>১৬। উভয় পায়ের আঙ্গুলগুলো তারতীবমত খিলাল করা। </p>
      <p>১৭। উযুর শেষে উপরের দিকে তাকিয়ে কালিমায়ে শাহাদাত পড়া।</p>
      <h3>উযু ও তায়াম্মুম ভঙ্গের কারণ ৭টি</h3>
      <p>১। পায়খানা বা পেশাবের রাস্তা দিয়ে কোন কিছু বের হওয়া।</p>
      <p>২। মুখ ভরে বমি হওয়া।</p>
      <p>৩। শরীরের ক্ষতস্থান হতে রক্ত, পুঁজ বা পানি বের হয়ে গড়িয়ে পড়া।</p>
      <p>৪। থুথুর সঙ্গে রক্তের ভাগ সমান বা বেশি হওয়া।</p>
      <p>৫। চিত হয়ে, কাত হয়ে বা হেলান দিয়ে ঘুমিয়ে যাওয়া।</p>
      <p>৬। পাগল, মাতাল ও অচেতন হওয়া।</p>
      <p>৭। নামাযে উচ্চঃস্বরে হাসা।</p>
      <h1 className="font-extrabold">গোসল</h1>
      <h3> গোসলে ৩ ফরয</h3>
      <p>১। ভালভাবে কুলি করা।</p>
      <p>২। নাকের নরম জায়গা পর্যন্ত পানি পৌঁছান।</p>
      <p>৩। সম্পূর্ণ শরীর ধৌত করা।</p>
      <h3>গোসলের তরীকা</h3>
      <p>১। ফরয গোসলের পূর্বে ইস্তিঞ্জা করা।</p>
      <p>২। শুরুতে বিসমিল্লাহির রাহমানির রাহীম পড়া।</p>
      <p>৩। উভয় হাত কব্জিসহ ধোয়া।</p>
      <p>
        ৪। শরীর বা কাপড়ে নাপাক লেগে থাকলে প্রথমে তা তিনবার ধুয়ে পবিত্র করা।
        নাপাকী না থাকলেও গুপ্তাঙ্গ ধৌত করা। এরপর উভয় হাত ভালভাবে ধুয়ে নেয়া।
      </p>
      <p>৫। গোসলের পূর্বে উযু করা।</p>
      <p>
        ৬। মাথায় পানি ঢালা, তারপর ডান কাঁধে ও পরে বাম কাঁধে পানি ঢালা। অতঃপর
        সমস্ত শরীর তিনবার এমনভাবে পানি দ্বারা ধৌত করা যেন একটি পশমের গোড়াও
        শুষ্ক না থাকে। তবে নদী-পুকুর ইত্যাদিতে গোসল করলে কিছুক্ষণ ডুব দিয়ে
        থাকলেই তিনবার পানি ঢালার সুন্নাত আদায় হবে।
      </p>
      <p>৭। সমস্ত শরীর ঘষে-মেজে ধৌত করা।</p>
      <p>
        ৮। মহিলাদের জন্য কানে-নাকে অলংকারাদি থাকলে, তার ছিদ্র ও আংটি, চুড়ি বা
        বয়লা ইত্যাদি নাড়া চাড়া দিয়ে পানি পৌঁছিয়ে দেয়া।
      </p>
      <p>
        ৯। শরীরের যে সমস্ত অঙ্গে সাধারণত পানি পৌঁছতে চায় না, যেমন : কান,
        আঙ্গুলের ফাঁক, কনুই, বগলের নীচ, চোখের কিনারা, চুলের গোড়া ইত্যাদি অঙ্গে
        খেয়াল করে পানি পৌঁছানো। (নখে নখপালিশ থাকলে, তা সম্পূর্ণ উঠানো ব্যতীত
        উযু গোসল হবে না।)
      </p>
      <p>১০। গোসলের ভিজা কাপড় তিনবার ধুয়ে তিনবার নিংড়ানো।</p>
      <h1 className="font-extrabold">তায়াম্মুম</h1>
      <h3>তায়াম্মুমে ৩ ফরয</h3>
      <p>১। নিয়ত করা।</p>
      <p>২। সম্পূর্ণ মুখমণ্ডল একবার মাসাহ্ করা।</p>
      <p>৩। উভয় হাত কুনইসহ একবার মাসাহ্ করা।</p>
      <h3>উযু ও তায়াম্মুম ভঙ্গের কারণ ৭টি</h3>
      <h3>উযু ও তায়াম্মুম ভঙ্গের কারণ ৭টি</h3>
      <p>১। পায়খানা বা পেশাবের রাস্তা দিয়ে কোন কিছু বের হওয়া।</p>
      <p>২। মুখ ভরে বমি হওয়া।</p>
      <p>৩। শরীরের ক্ষতস্থান হতে রক্ত, পুঁজ বা পানি বের হয়ে গড়িয়ে পড়া।</p>
      <p>৪। থুথুর সঙ্গে রক্তের ভাগ সমান বা বেশি হওয়া।</p>
      <p>৫। চিত হয়ে, কাত হয়ে বা হেলান দিয়ে ঘুমিয়ে যাওয়া।</p>
      <p>৬। পাগল, মাতাল ও অচেতন হওয়া।</p>
      <p>৭। নামাযে উচ্চঃস্বরে হাসা।</p>
      <h1 className="font-extrabold">ইস্তিঞ্জার আদব</h1>
      <h3>কয়েক দিকে ফিরে ইস্তিঞ্জা করা নিষেধ</h3>
      <p>১। কিবলার দিকে মুখ করে।</p>
      <p>২। কিবলার দিকে পিঠ করে।</p>
      <p>৩। চন্দ্র ও সূর্যের দিকে মুখ করে।</p>
      <p>৪। প্রবল বাতাসের দিকে মুখ করে।</p>
      <h3>১০ জায়গায় ইস্তিঞ্জা করা নিষেধ</h3>
      <p>১। মানুষ চলাচলের রাস্তায়।</p>
      <p>২। ছায়াদার বা ফলদার গাছের নীচে।</p>
      <p>৩। উযু-গোসলের স্থানে।</p>
      <p>৪। গর্তের ভিতরে, গোরস্তানে।</p>
      <p>৫। দাঁড়িয়ে বা হেঁটে হেঁটে।</p>
      <p>৬। বিনা উযরে পানিতে।</p>
      <p>৭। ঘরে বা বিছানায়।</p>
      <p>৮। মসজিদের আঙ্গিনায় বা ঈদগাহে।</p>
      <p>৯। নীচু জায়গায় বসে উঁচু জায়গায়।</p>
      <p>১০। জনসম্মুখে।</p>
      <h3>৬ জিনিস নিয়ে ইস্তিঞ্জায় যাওয়া নিষেধ</h3>
      <p>১। আল্লাহ তা‘আলার নাম।</p>
      <p>২। নবীগণের নাম।</p>
      <p>৩। ফেরেশতাগণের নাম।</p>
      <p>৪। কুরআনের আয়াত।</p>
      <p>৫। হাদীসের টুকরা।</p>
      <p>৬। দু‘আ কালাম। (লিখিত বা অংকিত)</p>
      <h3>ইস্তিঞ্জার সময় ৮ কাজ করা নিষেধ</h3>
      <p>১। কথা বলা,</p>
      <p>২। যিকির করা,</p>
      <p>৩। কুরআন শরীফ তিলাওয়াত করা,</p>
      <p>৪। সালাম দেওয়া,</p>
      <p>৫। সালামের উত্তর দেওয়া,</p>
      <p>৬। খাওয়া ও পান করা,</p>
      <p>৭। মিসওয়াক করা,</p>
      <p>৮। লেখা পড়া।</p>
    </div>
  );
}

export default PakPobitrota;
