import React from "react";

function Gosol() {
  return (
    <>
      <div>
        <h1 className="text-xl font-bold mb-5"> গোসলে ৩ ফরয</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। ভালভাবে কুলি করা।</p>
          <p>২। নাকের নরম জায়গা পর্যন্ত পানি পৌঁছান।</p>
          <p>৩। সম্পূর্ণ শরীর ধৌত করা।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">গোসলের তরীকা</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। ফরয গোসলের পূর্বে ইস্তিঞ্জা করা।</p>
          <p>২। শুরুতে বিসমিল্লাহির রাহমানির রাহীম পড়া।</p>
          <p>৩। উভয় হাত কব্জিসহ ধোয়া।</p>
          <p>
            ৪। শরীর বা কাপড়ে নাপাক লেগে থাকলে প্রথমে তা তিনবার ধুয়ে পবিত্র
            করা। নাপাকী না থাকলেও গুপ্তাঙ্গ ধৌত করা। এরপর উভয় হাত ভালভাবে ধুয়ে
            নেয়া।
          </p>
          <p>৫। গোসলের পূর্বে উযু করা।</p>
          <p>
            ৬। মাথায় পানি ঢালা, তারপর ডান কাঁধে ও পরে বাম কাঁধে পানি ঢালা।
            অতঃপর সমস্ত শরীর তিনবার এমনভাবে পানি দ্বারা ধৌত করা যেন একটি পশমের
            গোড়াও শুষ্ক না থাকে। তবে নদী-পুকুর ইত্যাদিতে গোসল করলে কিছুক্ষণ ডুব
            দিয়ে থাকলেই তিনবার পানি ঢালার সুন্নাত আদায় হবে।
          </p>
          <p>৭। সমস্ত শরীর ঘষে-মেজে ধৌত করা।</p>
          <p>
            ৮। মহিলাদের জন্য কানে-নাকে অলংকারাদি থাকলে, তার ছিদ্র ও আংটি, চুড়ি
            বা বয়লা ইত্যাদি নাড়া চাড়া দিয়ে পানি পৌঁছিয়ে দেয়া।
          </p>
          <p>
            ৯। শরীরের যে সমস্ত অঙ্গে সাধারণত পানি পৌঁছতে চায় না, যেমন : কান,
            আঙ্গুলের ফাঁক, কনুই, বগলের নীচ, চোখের কিনারা, চুলের গোড়া ইত্যাদি
            অঙ্গে খেয়াল করে পানি পৌঁছানো। (নখে নখপালিশ থাকলে, তা সম্পূর্ণ উঠানো
            ব্যতীত উযু গোসল হবে না।)
          </p>
          <p>১০। গোসলের ভিজা কাপড় তিনবার ধুয়ে তিনবার নিংড়ানো।</p>
        </div>
      </div>
    </>
  );
}

export default Gosol;
