import React from "react";

function NamazerForoz() {
  return (
    <div>
      <h1>নামাযের ফরয ওয়াজিব</h1>
      <h3>নামাযের বাইরে ৭ ফরয</h3>
      <p>
        ১। শরীর পাক। ২। কাপড় পাক। ৩। নামাযের জায়গা পাক। ৪। সতর ঢাকা। ৫।
        কিবলামুখী হওয়া। ৬। ওয়াক্ত মত নামায পড়া। ৭। নামাযের নিয়ত করা।
      </p>
      <h3>নামাযের ভিতরে ৬ ফরয</h3>
      <p>
        ১। তাকবীরে তাহরীমা বলা। ২। দাঁড়িয়ে নামায পড়া। ৩। ক্বিরা‘আত পড়া। ৪।
        রুকু করা। ৫। দুই সিজদা করা। ৬। আখিরী বৈঠক করা।
      </p>
      <h3>নামাযের ওয়াজিব ১৪টি</h3>
      <p>
        ১। সূরা ফাতিহা পুরা পড়া। ২। সূরা ফাতিহার সঙ্গে সূরা মিলানো। ৩।
        রুকু-সিজদায় দেরী করা। ৪। রুকু হতে সোজা হয়ে দাঁড়ানো। ৫। দুই সিজদার
        মাঝখানে সোজা হয়ে বসা। ৬। প্রথমে বৈঠক করা। ৭। উভয় বৈঠকে আত্তাহিয়্যাতু
        পড়া। ৮। ইমামের জন্য ক্বিরা‘আত আস্তে এবং জোরে পড়া। ৯। বিতরের নামাযে
        দু‘আয়ে কুনূত পড়া। ১০। দুই ঈদের নামাযে ছয়টি করে তাকবীর বলা। ১১। ফরয
        নামাযের প্রথম দুই রাকা‘আতকে কিরাআতের জন্য নির্ধারিত করা। ১২। প্রত্যেক
        রাকা‘আতের ফরযগুলোর তারতীব ঠিক রাখা। ১৩। প্রত্যেক রাকা‘আতের ওয়াজিবগুলোর
        তারতীব ঠিক রাখা। ১৪। ‘সালাম’ বলে নামায শেষ করা।
      </p>
    </div>
  );
}

export default NamazerForoz;
