import React from "react";

function RojarNiyat() {
  return (
    <div className="relative text-xl bg-[#f8ebd5] text-[#2e424d] px-[100px] py-20 space-y-5">
    <h1 className="bg-[#e49733] text-[#2e424d] text-center py-5 my-10 rounded-md font-bold text-2xl">
    রোযার নিয়্যাত
    </h1>
      <p>
        أَخْبَرَنِي الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا
        سَعِيدُ بْنُ شُرَحْبِيلَ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ
        أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ سَالِمِ بْنِ
        عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ، عَنِ
        النَّبِيِّ صلى الله عليه وسلم قَالَ " مَنْ لَمْ يُبَيِّتِ الصِّيَامَ
        قَبْلَ الْفَجْرِ فَلاَ صِيَامَ لَهُ " .
      </p>
      <p>
        উম্মুল মুমিনীন হাফসা রা. বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি
        ওয়াসাল্লাম বলেছেন-যে ব্যক্তি ফজরের আগে রোযা রাখার নিয়ত করবে না তার রোযা
        (পূর্ণাঙ্গ) হবে না।
      </p>
      <p>
        রোযার নিয়ত করা ফরয। নিয়ত অর্থ সংকল্প। যেমন মনে মনে এ সংকল্প করবে, আমি
        আল্লাহর সন'ষ্টির উদ্দেশ্যে আগামী কালের রোযা রাখছি। মুখে বলা জরুরি নয়।
      </p>
      <p>হাদীস শরীফে আছে, ‘সকল আমল নিয়তের উপর নির্ভরশীল।’- সহীহ বুখারী ১/২</p>
      <p>
        রাতে নিয়ত করতে না পারলে দিনে সূর্য ঢলার প্রায় এক ঘণ্টা আগে নিয়ত করলেও
        রোযা হয়ে যাবে। রাতে রোযার নিয়ত করলেও সুবহে সাদিক পর্যন্ত পানাহার ও
        স্ত্রী-মিলনের অবকাশ থাকে। এতে নিয়তের বা রোযার কোনো ক্ষতি হবে না।
      </p>
    </div>
  );
}

export default RojarNiyat;
