import React from "react";

function Home() {
  const home = [
    {
      id: 1,
      name: "ঘর থেকে বের হওয়ার দু‘আ",
      arabic:
        "بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ. لَا حَوْلَ وَلَا قُوَّةَ اِلَّا بِاللهِ",
      bangla:
        "বিসমিল্লাাহি তাওয়াক্কালতু ‘আলাল্লাাহি, লাা হাউলা ওয়ালাা কুউওয়াতা ইল্লাা বিল্লাাহ।",
      meaning:
        "আল্লাহ তা’আলার নামে বের হলাম, আমি আল্লাহ তাআলার উপর ভরসা করলাম। আল্লাহর তাওফিক ছাড়া গুনাহ থেকে বেঁচে থাকা বা কোনো নেক কাজ করা সম্ভব নয়।",
    },
    {
      id: 2,
      name: "ঘরে প্রবেশ করার দু‘আ",
      arabic:
        "اَللّٰهُمَّ اِنِّيْ اَسْاَلُكَ خَيْرَ الْمَوْلِجِ وَخَيْرَ الْمَخْرَجِ * بِسْمِ اللهِ وَلَجْنَا وَ بِسْمِ اللهِ خَرَجْنَا * وَعَلَى اللهِ رَبِّنَا تَوَكَّلْنَا",
      bangla:
        "আল্লাাহুম্মা ইন্নী আসআলুকা খাইরাল মাওলিজি ওয়া খাইরাল মাখরজি, বিসমিল্লাাহি ওয়ালাজনাা ওয়া বিসমিল্লাাহি খারাজনাা ওয়া ‘আলাল্লাাহি রব্বিনাা তাওয়াক্কালনাা।",
      meaning:
        "হে আল্লাহ! আমি আপনার নিকট ভিতরে প্রবেশ করার এবং বের হবার মঙ্গল কামনা করছি। আমরা আল্লাহ তা’আলার নামে প্রবেশ করলাম এবং আল্লাহর নামে বের হলাম এবং আমরা আমাদের প্রতিপালক আল্লাহর উপর ভরসা করলাম।",
    },
    {
      id: 3,
      name: "ঘর বাড়ি হেফাজতের দু’আ",
      arabic:
        "اللَّهُمَّ أَنْتَ رَبِّي، لَا إِلَهَ إِلَّا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، ‌مَا ‌شَاءَ ‌اللهُ ‌كَانَ، ‌وَمَا ‌لَمْ ‌يَشَأْ ‌لَمْ ‌يَكُنْ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ",
      bangla:
        " আল্লাহুম্মা আনতা রাব্বি লা ইলাহা ইল্লা আনতা আ’লাইকা তাওয়াক্কালতু ও আনতা রাব্বুল আ’রশিল আজিম, মা-শা-আল্লাহু কা’না, ওয়ামা লাম ইয়াশা’ লাম ইয়াকুন ওয়ালা হাওলা ওয়ালা কুও’ওয়াতা ইল্লা বিল্লাহিল আলিঈল আজিম, আলামু আন্নাল্লাহা আলা কুল্লি শাই ইন ক্বাদির ও আন্নাল্লাহা ক্বাদ আহাতা বিকুল্লি শাই ইন ই’লমা, আল্লাহুম্মা ইন্নি আ‘উজুবিকা মিন শাররি নাফসি ওয়ামিন শাররি কুল্লি দাব্বাতিন; আনতা আখিজুম বিনাসিয়াতিহা ইন্না রাব্বি’আলা সিরাতিম মুস্তাকিম।",
      meaning:
        "হে আল্লাহ্‌ ! আপনি আমার প্রভু, আপনি ব্যতীত অন্য কোনো ইলাহ্‌ নাই, আপনার উপর ভরসা করলাম, আপনি সম্মানিত আরশের মালিক। আল্লাহ্‌ তাআ’লা যা ইচ্ছা করেন, তাই হয়; আর তিনি যা ইচ্ছা করেন না তা হয় না, আল্লাহ্‌ তা’আলার শক্তি ও সামর্থ্য ব্যতীত অন্য কোনো শক্তি বা সামর্থ নাই, জেনে রেখো যে আল্লাহ্‌ তাআ’লা সমস্ত জিনিসের উপর শক্তিশালী, ক্ষমতাবান এবং তার জ্ঞান সমস্ত জিনিসব্যাপ্ত। হে আল্লাহ্‌! আমার নফ্‌সের মন্দ হতে আপনার নিকট আশ্রয় চাই এবং প্রত্যেক প্রাণীর মন্দ হতে যার ঝুঁটি আপনি ধরে রেখেছেন; নিশ্চয়ই আমার প্রভু সরল পথে অধিষ্ঠিত আছেন।",
    },
    {
      id: 4,
      name: "উপরে ওঠার সময়",
      arabic: "اَللّٰهُ اَكْبَرْ",
      bangla: " আল্লাহু আকবার।",
      meaning: "আল্লাহ সবচেয়ে বড়।",
    },
    {
      id: 5,
      name: "নীচে নামার সময়",
      arabic: "سُبْحَانَ اللّٰهِ",
      bangla: "সুব্‌হানাল্লাহ।",
      meaning: "আমি আল্লাহর পবিত্রতা ও মহিমা বর্ণনা করছি।",
    },
  ];
  return (
    <div className="relative text-xl">
      <ul className="space-y-2">
        {home.map((data, id) => (
          <li
            key={id}
            className="space-y-3 p-4 border border-[#a6a6a8] rounded-lg"
          >
            <h1 className="text-xl font-bold mb-2 mt-2">{data.name}</h1>
            <div className="border-[1px] border-[#98dad9]"></div>
            <p className="text-center font-bold py-5">{data.arabic}</p>
            <p>
              <span className="font-bold">উচ্চারণঃ </span>
              {data.bangla}
            </p>
            <p>
              <span className="font-bold">অর্থঃ </span>
              {data.meaning}
            </p>
          </li>
        ))}
      </ul>
    </div>
  );
}

export default Home;
