import React from "react";

function Ozu() {
  return (
    <>
      <div>
        <h1 className="text-xl font-bold mb-5">উযুতে ৪ ফরয</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। সম্পূর্ণ মুখ ধোয়া।</p>
          <p>২। উভয় হাত কনুইসহ ধোয়া।</p>
          <p>৩। মাথার এক চতুর্থাংশ মাসাহ্ করা।</p>
          <p>৪। উভয় পা টাখনুসহ ধোয়া।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">উযু করার (সুন্নাত) তরীকা</h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। উযুর নিয়ত করা।</p>
          <p>২। বিসমিল্লাহ পড়া।</p>
          <p>৩। উভয় হাত কব্জিসহ তিনবার ধোয়া।</p>
          <p>৪। মিস্ওয়াক করা।</p>
          <p>৫। তিনবার কুলি করা।</p>
          <p>৬। তিনবার নাকে পানি দেয়া ও নাক ঝাড়া।</p>
          <p>৭। সম্পূর্ণ মুখ তিনবার ধোয়া। </p>
          <p>৮। ডান হাত কনুইসহ তিনবার ধোয়া।</p>
          <p>৯। বাম হাত কনুইসহ তিনবার ধোয়া।</p>
          <p>১০। উভয় হাতের আঙ্গুলগুলো খিলাল করা। </p>
          <p>১১। সম্পূর্ণ মাথা একবার মাসাহ্ করা।</p>
          <p>১২। উভয় কান একবার মাসাহ করা।</p>
          <p>১৩। ঘাড় মাসাহ্ করা।</p>
          <p>১৪। ডান পা টাখনুসহ তিনবার ধোয়া।</p>
          <p>১৫। বাম পা টাখনুসহ তিনবার ধোয়া।</p>
          <p>১৬। উভয় পায়ের আঙ্গুলগুলো তারতীবমত খিলাল করা। </p>
          <p>১৭। উযুর শেষে উপরের দিকে তাকিয়ে কালিমায়ে শাহাদাত পড়া।</p>
        </div>
      </div>
      <div>
        <h1 className="text-xl font-bold mb-5">
          উযু ও তায়াম্মুম ভঙ্গের কারণ ৭টি
        </h1>
        <div className="space-y-2 mb-5 text-xl">
          <p>১। পায়খানা বা পেশাবের রাস্তা দিয়ে কোন কিছু বের হওয়া।</p>
          <p>২। মুখ ভরে বমি হওয়া।</p>
          <p>
            ৩। শরীরের ক্ষতস্থান হতে রক্ত, পুঁজ বা পানি বের হয়ে গড়িয়ে পড়া।
          </p>
          <p>৪। থুথুর সঙ্গে রক্তের ভাগ সমান বা বেশি হওয়া।</p>
          <p>৫। চিত হয়ে, কাত হয়ে বা হেলান দিয়ে ঘুমিয়ে যাওয়া।</p>
          <p>৬। পাগল, মাতাল ও অচেতন হওয়া।</p>
          <p>৭। নামাযে উচ্চঃস্বরে হাসা।</p>
        </div>
      </div>
    </>
  );
}

export default Ozu;
