import React from "react";

function NamajVongerKaron() {
  return (
    <div className="relative text-xl bg-[#f8ebd5] text-[#2e424d] px-[100px] py-10 space-y-5">
      <h1 className="bg-[#e49733] text-[#2e424d] text-center py-5 my-10 rounded-md font-bold text-2xl">
        নামায ভঙ্গের কারণ
      </h1>
      <h1 className="text-xl font-bold mb-5">নামায ভঙ্গের কারণ</h1>
      <div className="space-y-2 mb-5 text-xl">
        <p> ১. নামাযে অশুদ্ধ পড়া।</p>
        <p> ২. নামাযের ভিতরে কথা বলা।</p>
        <p> ৩. কোন লোককে সালাম দেয়া। </p>
        <p> ৪. সালামে উত্তর দেয়া।</p>
        <p>৫. উহ্-আহ্ শব্দ করা।</p>
        <p> ৬. বিনা ওযরে কাশি দেয়া।</p>
        <p> ৭. আমলে কাছীর করা। </p>
        <p> ৮. বিপদে বা বেদনায় শব্দ করে কাঁদা।</p>
        <p> ৯. তিন তাসবীহ পরিমাণ সময় সতর খুলে থাকা।</p>
        <p> ১০. মুত্তাদি ব্যতীত অপর ব্যক্তির লোকমা গ্রহণ করা। </p>
        <p>
          ১১. সুসংবাদের বা দুঃসংবাদের উত্তর দেয়া। ‘ইন্না লিল্লাহি ওয়া ইন্না
          ইলাইহি রাজি‘উন’ বলা।
        </p>
        <p> ১২. নাপাক জায়গায় সিজদা করা। </p>
        <p> ১৩. কিবলার দিক হতে সিনা ঘুরে যাওয়া। </p>
        <p> ১৪. নামাযে কুরআন শরীফ দেখে পড়া।</p>
        <p> ১৫. নামাযে শব্দ করে হাসা।</p>
        <p>১৬. নামাযে দুনিয়াবী কোন কিছু প্রার্থনা করা। </p>
        <p> ১৭. হাঁচির উত্তর দেয়া। (জাওয়াবে ‘ইয়ারহামুকাল্লাহ’ বলা) </p>
        <p>১৮. নামাযে খাওয়া বা পান করা।</p>
        <p> ১৯. ইমাম হতে এগিয়ে মুক্তাদির খাড়া হওয়া।</p>
      </div>
    </div>
  );
}

export default NamajVongerKaron;
