import React from "react";

function Sahri() {
  return (
    <div className="space-y-2 mb-5 text-xl">
      <p>
        باب بَرَكَةِ السَّحُورِ مِنْ غَيْرِ إِيجَابٍ لأَنَّ النَّبِيَّ صَلَّى
        اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ وَاصَلُوا وَلَمْ يُذْكَرِ
        السَّحُورُ حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، حَدَّثَنَا شُعْبَةُ،
        حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ
        مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم "
        تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً ".
      </p>
      <p>
        হযরত আনাস ইবনে মালিক (রাঃ) থেকে বর্ণিত, তিনি বলেন : রাসূলুল্লাহ
        সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন : তোমরা সেহরী খেয়ে রোজা রাখো।
        কারণ, সেহরী খাওয়ার মধ্যে সওয়াব ও বরকত রয়েছে । (সহীহ বুখারী)
      </p>
      <p>
        রোযার নিয়তে সুবহে সাদিকের পূর্বে যে খাবার গ্রহণ করা হয় তা হল সাহরী।
        সাহরী খাওয়া সুন্নত। সাহরীতে পেট ভরে খাওয়া আবশ্যক নয়; এক দুই ঢোক পানি পান
        করেও এ সুন্নত আদায় করা যায়। সাহরীতে রয়েছে বরকত রাসূলুল্লাহ সাল্লাল্লাহু
        আলাইহি ওয়াসাল্লাম ইরশাদ করেন-
      </p>
      <p>تَسَحّرُوا فَإِنّ فِي السّحُورِ بَرَكَةً.</p>
      <p>তোমরা সাহরী কর। কেননা সাহরীর খাবারে বরকত রয়েছে। (সহীহ বুখারী)</p>
    </div>
  );
}

export default Sahri;
