import React from "react";

function Healthy() {
  const healthy = [
    {
      id: 1,
      name: " শ্বেত ও কুষ্ঠ রোগ থেকে পানাহ",
      arabic:
        "اَللَّهُمَّ اِنِّىْ اَعُوْذُ بِكَ مِنَ الْبَرَصِ وَ الْجُنُوْنِ وَ الْجُذَامِ وَمِنْ سَىِّءِ الْاَسْقَامِ",
      bangla:
        " আল্লহুম্মা ইন্নি আউযুবিকা মিনাল বারাসি ওয়াল জুনুনি ওয়াল জুযামি ওয়া মিন ছাইয়্যি ইল আসক্বম",
      meaning:
        "হে আল্লাহ! আমি তোমার কাছে আশ্রয় চাই শ্বেতকুষ্ঠ উন্মাদনা, কুষ্ঠরোগ এবং সমস্ত খারাপ রোগ হতে।",
    },
    {
      id: 2,
      name: " কঠিন রোগমুক্তির দু’আ",
      arabic:
        "رَبِّ  اَنِّـىْ  مَـسَّـنِـىَ  الـضُّـرُّ  وَاَنْـتَ  اَرْحَـمُ  الـرّحِـمِـيْـنَ",
      bangla:
        "রাব্বি আন্নি মাস্‌সানিয়াদ্দ্বুর্‌রু ওয়া আন্তা আরহামুর্‌ রাহিমিন।",
      meaning: "আমি দুঃখ-কষ্টে পড়েছি, তুমিতো সর্বশ্রেষ্ঠ দয়ালু।",
    },
    {
      id: 3,
      name: " জ্বর হলে",
      arabic:
        "بِسْمِ اللّٰهِ الْكَبِيْرِ اَعُوْذُ بِاللّٰهِ الْعَظِيْمِ مِنْ شَرِّ كُلِّ عِرْقٍ نَّعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ .",
      bangla:
        "বিসমিল্লাাহিল কাবীরি আ‘ঊযুবিল্লাা হিল ‘আযীমি মিন শাররি কুল্লি ‘ইরক্বিন না‘আা রিন ওয়া মিন শাররি হার রিন্নাার।",
      meaning:
        " মহান আল্লাহর নামের সাথে আমি মহান আল্লাহ তা‘আলার আশ্রয় গ্রহণ করছি প্রত্যেক উত্তেজিত ধমনীর অনিষ্ট হতে এবং দোযখের উত্তাপের অনিষ্ট হতে।",
    },
    {
      id: 4,
      name: "অসুস্থ ব্যক্তিকে দেখতে গেলে",
      arabic:
        "لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ >> أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ",
      bangla:
        "লা বা’সা তাহুরুন ইন-শা-আল্লাহ >> আস আলুল্লাাহাল ‘আযীম রব্বাল ‘আরশিল ‘আযীম আইঁ ইয়াশ ফিয়াক। (৭ বার)",
      meaning:
        " বিচলিত হওয়ার কোন কারণ নেই। (আপনি সুস্থ হয়ে যাবেন) ইনশাআল্লাহ্‌ এই রোগ (বাহ্যিক ও অভ্যন্তরীণ অপবিত্রতা হতে) পবিত্রতা সাধনকারী। + এরপরে সাতবার এই দুআ পড়বে : আমি আরশে আযীমের মালিক, মহান আল্লাহ্‌ তাআলার নিকট আপনার সুস্থতার জন্যে দু’আ করছি।",
    },
    {
      id: 5,
      name: " দৃষ্টি,শ্রবণের সুস্থতা,দারিদ্র্যমুক্তি ও নিরাপত্তার দু'আ",
      arabic:
        "اللّٰهُمَّ عَافِنِيْ فِيْ بَدَنِيْ، اللّٰهُمَّ عَافِنِيْ فِيْ سَمْعِيْ، اللّٰهُمَّ عَافِنِيْ فِيْ بَصَرِيْ، لَا إِلٰهَ إِلَّا أَنْتَ، اللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، اللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ .",
      bangla:
        "আল্লাহুম্মা আফিনি ফি বাদানি, আল্লাহুম্মা আফিনি ফি সাময়ি, আল্লাহুম্মা আফিনি ফি বাসারি, লা ইলাহা ইল্লা আন্তা, আল্লাহুম্মা ইন্নি আউজুবিকা মিনাল কুফরি, ওয়াল ফাকরি, আল্লাহুম্মা ইন্নি আউজুবিকা মিন আজাবিল কাবরি, লা ইলাহা ইল্লা আন্তা।",
      meaning:
        "হে আল্লাহ! আপনি আমাকে শারীরিক সুস্থতা ও নিরাপত্তা দান করুন। হে আল্লাহ! আমার শ্রবণে সুস্থতা ও নিরাপত্তা দান করুন। আমার দৃষ্টিতে সুস্থতা ও নিরাপত্তা দান করুন। আপনি ব্যতিত কোনো ইলাহ নেই। হে আল্লাহ! আমি আপনার আশ্রয় গ্রহণ করছি কুফুরী ও দারিদ্র্য থেকে। হে আল্লাহ! আমি আপনার কাছে পানাহ চাই কবরের আজাব থেকে। আপনি ছাড়া কোনো ইলাহ নেই।",
    },
  ];
  return (
    <div className="relative text-xl bg-[#e8e9f3] text-[#2e424d] px-[100px] py-10">
      <h1 className="bg-[#98dad9] text-center py-5 my-10 rounded-md font-bold text-xl">
      সুস্থতা-অসুস্থতা
      </h1>
      <ul className="space-y-2">
        {healthy.map((data, id) => (
          <li
            key={id}
            className="space-y-3 p-4 border border-[#a6a6a8] rounded-lg"
          >
            <h1 className="text-xl font-bold mb-2 mt-2">{data.name}</h1>
            <div className="border-[1px] border-[#98dad9]"></div>
            <p className="text-center font-bold py-5">{data.arabic}</p>
            <p>
              <span className="font-bold">উচ্চারণঃ </span>
              {data.bangla}
            </p>
            <p>
              <span className="font-bold">অর্থঃ </span>
              {data.meaning}
            </p>
          </li>
        ))}
      </ul>
    </div>
  );
}

export default Healthy;
