import React from 'react'

function NamajVongerKaron() {
  return (
    <div>
        <h1>
        নামায ভঙ্গের কারণ
        </h1>
        <p>
        ১. নামাযে অশুদ্ধ পড়া।

২. নামাযের ভিতরে কথা বলা।

৩. কোন লোককে সালাম দেয়া।

৪. সালামে উত্তর দেয়া।

৫. উহ্-আহ্ শব্দ করা।

৬. বিনা ওযরে কাশি দেয়া।

৭. আমলে কাছীর করা।

৮. বিপদে বা বেদনায় শব্দ করে কাঁদা।

৯. তিন তাসবীহ পরিমাণ সময় সতর খুলে থাকা।

১০. মুত্তাদি ব্যতীত অপর ব্যক্তির লোকমা গ্রহণ করা।

১১. সুসংবাদের বা দুঃসংবাদের উত্তর দেয়া।

‘ইন্না লিল্লাহি ওয়া ইন্না ইলাইহি রাজি‘উন’ বলা।

১২. নাপাক জায়গায় সিজদা করা।

১৩. কিবলার দিক হতে সিনা ঘুরে যাওয়া।

১৪. নামাযে কুরআন শরীফ দেখে পড়া।

১৫. নামাযে শব্দ করে হাসা।

১৬. নামাযে দুনিয়াবী কোন কিছু প্রার্থনা করা।

১৭. হাঁচির উত্তর দেয়া।

(জাওয়াবে ‘ইয়ারহামুকাল্লাহ’ বলা)

১৮. নামাযে খাওয়া বা পান করা।

১৯. ইমাম হতে এগিয়ে মুক্তাদির খাড়া হওয়া।
        </p>
    </div>
  )
}

export default NamajVongerKaron