import React from "react";

function Tarabih() {
  return (
    <div>
      <h1>তারাবীর নামায</h1>
      <p>
        রমজান মাসের এশার নামাজের পর ২০ রাকায়াত সুন্নাতে মুয়াক্কাদাহ নামাজকে
        তারাবীহ নামাজ বলা হয়। তারাবী শব্দটি আরবী তরাবীহাহ্। তার বহুবচন তারাবীহ,
        যার অর্থ ক্ষনিক বিশ্রাম। রমজানের এই নামাজে প্রতি ৪ রাকায়াতের পরে কিছু
        সময় অর্থাৎ ৪ রাকায়াত নামাজের সম পরিমান সময় বিলম্ব ও বিশ্রামের নিয়ম থাকায়
        এ নামাজে এরূপ নামকরণ করা হয়েছে।
      </p>
      <p>
        মাহে রমযানের বিশেষ ইবাদত তারাবী। গোটা মুসলিম জাহানে তারাবীর নামায
        অত্যন্ত আগ্রহ-উদ্দীপনার সাথে আদায় হয়ে থাকে। তারাবী অতি বরকতময় সুন্নত।
        আল্লাহ্র রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মুবারক যামানা থেকেই
        তারাবী মাহে রমযানের অতি ফযীলতপূর্ণ ইবাদত। ঐকান্তিকতা ও একনিষ্ঠতার সাথে
        এই ইবাদতে মশগুল থাকা কাম্য।
      </p>
      <p>
        রাসূল সাল্লাল্লাহু তাআলা আলাইহি ওয়াসাল্লাম বলেন, "(হে আমার উম্মতগন),
        তোমরা জেনে রেখ আল্লাহ তোমাদের উপর রমজানের রোজা ফরজ করেছেন এবং উহার
        রাত্রে তারাবীহের নামাজ সুন্নাত করেছেন। অতএব, যে ব্যক্তি খালেস নিয়তে
        ঈমানের সাথে কেবল সোয়াবের আশায় এ মাসে দিনের বেলায় রীতিমত রোজা রাখবে এবং
        রাত্রিতে রীতিমত তারাবীহের নামাজ পড়বে তার বিগত সব সগীরা গুনাহ মিটিয়ে দেয়া
        হবে।" অতএব, এ পবিত্র মাসে অধিক নেকী সঞ্চ্য করে লওয়া উচিৎ।
      </p>
    </div>
  );
}

export default Tarabih;
