import React from "react";

function Bipod() {
  const bipod = [
    {
      id: 1,
      name: "ঋণ পরিশোধের দু’আ",
      arabic:
        "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      bangla:
        "আল্লাহুম্মাক ফিনি বিহালালিকা ’আন হারা-মিকা ওয়া আগনিনি বি ফাদলিকা আম্মান সিওয়াক।",
      meaning:
        "হে আল্লাহ তুমি তোমার হারাম বস্তু হতে বাঁচিয়ে তোমার হালাল রিযিক দ্বারা আমাকে পরিতুষ্ট করে দাও ( হালাল রুজিই যেন আমার জন্য যথেষ্ট হয় ) এবং হারামের দিকে যাওয়ার প্রয়োজন এবং প্রবণতা বোধ না করি এবং তোমার অনুগ্রহ অবদান দ্বারা তুমি ভিন্ন অন্য সকল হতে আমাকে অমুখাপেক্ষী করে দাও।",
    },
    {
      id: 2,
      name: "মুসিবতের সম্মুখীন হলে",
      arabic:
        "اِنَّا لِلّٰهِ وَاِنَّا اِلَيْهِ رَاجِعُوْنَ. اَللّٰهُمَّ اْجُرْنِيْ فِـيْ مُصِيْبَتِيْ. وَاَخْلِفْ لِيْ خَيْرًا مِّنْهَا.",
      bangla:
        "ইন্নাা লিল্লাাহি ওয়া ইন্নাা ইলাইহি রাাজি‘ঊন, আল্লাাহুম্মা’ জুরনী ফী মুসী বাতী ওয়া আখলিফলী খইরম মিনহাা।",
      meaning:
        " নিঃসন্দেহে আমরা আল্লাহ তায়ালারই জন্য এবং আল্লাহ তায়ালারই দিকে ফিরিয়া যাইব। আয় আল্লাহ ! আমাকে আমার মুসিবতের উপর সওয়াব দান করুন, আর যে জিনিস আপনি আমার নিকট হইতে লইয়া গিয়াছেন উহা হইতে উত্তম জিনিস আমাকে দান করুন।",
    },
    {
      id: 3,
      name: "দুঃসংবাদ শুনলে",
      arabic: "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
      bangla: " ইন্না লিল্লাহি ওয়া ইন্না ইলাইহি রজিউন।",
      meaning:
        " আমরাতো আল্লাহরই এবং নিশ্চিতভাবে আমরা তাঁর নিকট প্রত্যাবর্তনকারী।",
    },
    {
      id: 4,
      name: "কোনো সমস্যার সম্মুখীন হলে",
      arabic: "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ اَسْتَغِيْثُ",
      bangla: " ইয়া হাইয়ু ইয়া কাইয়ুম বিরাহ্‌মাতিকা আস্তাগিস।",
      meaning:
        "হে চিরঞ্জীব! হে সকল বস্তুর ধারক! আমি আপনারই রহমতের প্রার্থনা করছি।",
    },
    {
      id: 5,
      name: "বিষাক্ত প্রানী থেকে বাঁচার দু’আ",
      arabic: "أعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
      bangla: "আউযুবি কালিমাতিল্লাহিত তাম্মাতি মিনসাররি-মা-খলাক।",
      meaning:
        "আমি আল্লাহ্‌ তায়ালার সমস্ত (উপকারী ও শেফাদানকারী) কলেমা দ্বারা তাহার সমস্ত মাখলুকের অনিষ্ট হইতে আশ্রয় চাহিতেছি।",
    },
    {
      id: 6,
      name: "বদ নযর থেকে হেফাযতের দু‘আ",
      arabic:
        "اَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَّهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ.",
      bangla:
        " আ‘ঊযু বিকালিমাা তিল্লাা হিত তাা ম্মাতি মিন কুল্লি শাইত্বাা নিউ ওয়া হাা ম্মাতিন ওয়া মিন কুল্লি ‘আইনীন লাাম্মাহ।",
      meaning:
        " সকল শয়তান, কীটপতঙ্গ ও বদ নযর হতে আল্লাহর পূর্ণাঙ্গ কালিমাসমূহের মাধ্যমে আশ্রয় চাচ্ছি।",
    },
    {
      id: 7,
      name: "শিশুদের হেফাজতের দু‘আ",
      arabic:
        "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
      bangla:
        "আ‘ঊযু বিকালিমা-তিল্লা-হিত তা-ম্মাতি মিন কুল্লি শাইতানিওঁ ওয়া হা-ম্মাহ, ওয়ামিন কুল্লি আইনিল্লা-ম্মাহ্‌।",
      meaning:
        " আমি আশ্রয় গ্রহণ করছি আল্লাহর পরিপূর্ণ কথাসমূহের, সকল শয়তান থেকে, সকল ক্ষতিকারক পোকামাকড় ও প্রাণী থেকে এবং সকল ক্ষতিকারক দৃষ্টি থেকে।",
    },
    {
      id: 8,
      name: "দুশ্চিন্তা বা বিপদগ্রস্তের দোয়া",
      arabic:
        "اللَّهُ، اللَّهُ رَبِّى لاَ أُشْرِكُ بِهِ شَيْئًا، اللَّهُ اللَّهُ رَبِّى لاَ أُشْرِكُ بِهِ شَيْئًا",
      bangla:
        " আল্লা-হু, আল্লা-হু রাব্বী, লা- উশরিকু বিহী শাইআন। আল্লা-হু, আল্লা-হু রাব্বী, লা- উশরিকু বিহী শাইআন",
      meaning:
        "আল্লাহ, আল্লাহ, আমার রব, তার সাথে কাউকে শরীক করি না, আল্লাহ, আল্লাহ, আমার রব, তার সাথে কাউকে শরীক করি না।",
    },
  ];
  return (
    <div className="relative text-xl bg-[#f8ebd5] text-[#2e424d] px-[100px] py-10">
      <div className="bg-[#e49733] py-5 flex justify-between my-10 rounded-md px-10">
        <h1 className=" text-[#2e424d] text-center  font-bold text-2xl">
          বিপদ বালা মুসিবত
        </h1>
        <IoMdReturnRight size={40} />
      </div>
      <ul className="space-y-2">
        {bipod.map((data, id) => (
          <li
            key={id}
            className="space-y-3 p-4 border border-[#a6a6a8] rounded-lg"
          >
            <h1 className="text-xl font-bold mb-2 mt-2">{data.name}</h1>
            <div className="border-[1px] border-[#f8ebd5]"></div>
            <p className="text-center font-bold py-5">{data.arabic}</p>
            <p>
              <span className="font-bold">উচ্চারণঃ </span>
              {data.bangla}
            </p>
            <p>
              <span className="font-bold">অর্থঃ </span>
              {data.meaning}
            </p>
          </li>
        ))}
      </ul>
    </div>
  );
}

export default Bipod;
