import React from "react";

function Sleep() {
  const sleep = [
    {
      id: 1,
      desc: " ডান হাত ডান গালের নিচে রেখে ঘুমানো।",
    },
    {
      id: 2,
      desc: "ঘুমানোর পূর্বে এই দোয়া পাঠ করা اللهم باسمك اموت واحيا",
    },
    {
      id: 3,
      desc: "রাতে ঘুমানোর সময় তিনকূল পরে উভয় হাতে দম করে সমস্ত শরীর মোছা।",
    },
    {
      id: 4,
      desc: "উঁচু করে শয়ন করা।",
    },
    {
      id: 5,
      desc: " শোওয়ার পূর্বে বিছানা ভালোভাবে ঝেড়ে নেওয়া।",
    },
    {
      id: 6,
      desc: "শয়ন এর পূর্বে বিসমিল্লাহ বলে নিম্নের কাজগুলো করা: ক. দরজা বন্ধ করা। খ. মশক বা পানির পাত্র এবং খাদ্যদ্রব্যের পাত্র ও অন্যান্য পাত্রসমূহ ঢেকে রাখা। যদি ঢাকার জন্য কোন বস্তু না পাওয়া যায়, তাহলে 'বিসমিল্লাহ' পড়ে তার মুখে একটি লাঠি বা ছরি রেখে দেওয়া। গ. বাতি নিভানো।",
    },
    {
      id: 7,
      desc: "শয়ন করার পর ভয়ে ঘুম না আসলে এই দোয়া পড়া: اعوذ بكلمات الله التامه من غضبه وعقابه وشر عباده ومن همزات الشياطين ان يحضرون",
    },
    {
      id: 8,
      desc: "স্বপ্নে ভয়ঙ্কর কিছু দেখে চোখ খুলে গেলে তিনবার اعوذ بالله من الشيطان الرجيم পড়ে বাঁদিকে থুতু ফেলে পার্শ্ব পরিবর্তন করে শোয়া। তাতে ক্ষতির আর কোন আশঙ্কা থাকে না এবং এই দোয়াটি পড়া: اللهم اني اعوذ بك من شر هذه الرؤيا",
    },
    {
      id: 9,
      desc: "দুপুরের খানার পর কিছুক্ষণ কাইলুলাহ করা অর্থাৎ শয়ন করা।",
    },
    {
      id: 10,
      desc: "ঘুমানোর পূর্বে তাজবিহে ফাতেমি অর্থাৎ ৩৩ বার সুবহানাল্লাহ ৩৩ বার আলহামদুলিল্লাহ ৩৪ বার আল্লাহু আকবার পড়া।",
    },
  ];

  return (
    <section className="text-[#2e424d]">
      <div className="relative">
        <ul className="grid gap-8 sm:grid-cols-1 lg:grid-cols-2">
          {sleep.map((data, id) => (
            <li
              key={id}
              className="space-y-3 p-4 border border-[#a6a6a8] rounded-lg"
            >
              <p>{data.desc}</p>
            </li>
          ))}
        </ul>
      </div>
    </section>
  );
}

export default Sleep;
