import React from "react";

function PuruserNamaj() {
  return (
    <div>
      <h1>পুরুষদের নামায</h1>
      <h3>দাঁড়ানোতে ৭ কাজ</h3>
      <p>
        ১. পায়ের আঙ্গুলসমূহ কিবলার দিকে সোজাভাবে রাখা। ২. উভয় পায়ের মাঝখানে
        চার আঙ্গুল (উর্ধ্বে এক বিঘত) পরিমাণ ফাঁক রাখা। ৩. উভয় পায়ের
        বৃদ্ধাঙ্গুলিদ্বয় ও গোঁড়ালিদ্বয়ের মাঝে সমান দূরত্ব রাখা। ৪. তাকবীরে
        তাহরীমা শুরু করা পর্যন্ত হাত ছেড়ে রাখা। (হাত বেঁধে না রাখা)। ৫.
        সম্পূর্ণ সোজা হওয়া (এক পায়ে ভর দিয়ে বাঁকা হয়ে না দাঁড়ানো)। ৬. ঘাড়
        সোজা রাখা। চেহারা জমিনের দিকে না করা। ৭. সিজদার জায়গার দিকে নজর রাখা।
      </p>
      <h3>হাত উঠানোতে ৮ কাজ</h3>
      <p>
        ১. তাকবীরে তাহরীমার সময় হাত চাদরের ভিতরে থাকলে, বাইরে বের করা। ২. হাত
        উঠানোর সময় মাথা না ঝুঁকানো। ৩. হাত কান পর্যন্ত উঠানো (উভয় হাতের
        বৃদ্ধাঙ্গুলি দ্বারা কানের লতি স্পর্শ করা)। ৪. হাতের আঙ্গুলগুলো স্বাভাবিক
        ফাঁক রাখা। ৫. হাতের তালু সম্পূর্ণ কিবলামুখী করে রাখা, আঙ্গুলের মাথা
        বাঁকা না করা। বরং আকাশমুখী করে রাখা। ৬. তাকবীরে তাহরীমা বলার প্রাক্কালে
        উক্ত নামাযের খেয়াল (নিয়ত) মনে হাজির করা। [ফরয] ৭। তারপর তাকবীরে
        তাহরীমা শুরু করা। তাকবীরে তাহরীমা এক আলিফ থেকে বেশি না টানা। ৮. তাকবীরে
        তাহরীমা বলার পর সরাসরি হাত বাঁধা। (হাত বাঁধার আগে হাত ঝুলিয়ে না দেয়া)।
      </p>
      <h3>হাত বাঁধায় ৪ কাজ</h3>
      <p>
        ১. ডান হাতের তালু বাম হাতের পিঠের উপর রাখা। ২. ডান হাতের বৃদ্ধাঙ্গুলি ও
        কনিষ্ঠাঙ্গুলি দ্বারা বাম হাতের কব্জি ধরা। ৩. বাকি আঙ্গুলগুলো বাম হাতের
        উপর স্বাভাবিক অবস্থায় রাখা। ৪. নাভির নীচে হাত বাঁধা।
      </p>
      <h3>হাত বাঁধার পর ৮ কাজ</h3>
      <p>
        ১. ছানা পড়া ২. আ‘উযুবিল্লাহ পড়া। ৩. বিসমিল্লাহ পড়া। (উল্লেখ্য যে,
        পরবর্তী রাক‘আতে ছানা ও আ‘উজুবিল্লাহ পড়তে হয় না) ৪. সূরা ফাতিহা পড়া
        [ওয়াজিব]। ৫. সূরা ফাতিহা পড়ার পর নীরবে আমীন বলা। ৬. সূরা মিলানো (ফযরের
        প্রথম দু’রাকা‘আতে এবং ওয়াজিব, সুন্নাত ও নফলের সব ক’টি রাকা‘আতে)
        [ওয়াজিব]। ৭. সূরা মিলানোর পূর্বে বিসমিল্লাহ পড়া। ৮. মাসনূন ক্বিরা‘আত
        পড়া।
      </p>
      <h3>রুকুতে ৯টি কাজ</h3>
      <p>
        ১. রুকু‘তে যাওয়ার সময় তাকবীর বলা। ২. উভয় হাত দ্বারা হাঁটু ধরা। ৩.
        হাতের আঙ্গুলসমূহ ফাঁক রাখা। ৪. উভয় হাত সম্পূর্ণ সোজা রাখা, কনুই বাঁকা
        না করা। ৫. মাথা, পিঠ ও কোমর এক সমান রাখা। ৬. পায়ের গোছা, হাঁটু ও উরু
        সোজা রাখা (হাঁটু বাঁকা না করা)। ৭. পায়ের দিকে নজর রাখা। ৮. রুকু‘তে
        কমপক্ষে তিনবার রুকু‘র তাসবীহ্ (সুবহানা রাব্বিয়াল আজীম) পড়া। ৯. রুকু‘
        করা ফরয এবং রুকুতে কমপক্ষে এক তাসবীহ পরিমাণ দেরী করা ওয়াজিব।
      </p>
      <h3>রুকু থেকে উঠায় ৩ কাজ</h3>
      <p>
        ১. রুকু থেকে উঠার সময় ‘সামি‘আল্লাহু লিমান হামিদাহ্’ বলা। ২. সোজা হয়ে
        (হাত ছেড়ে) দাঁড়ানো এবং দাঁড়ানোর পর এক তাসবীহ পরিমাণ বিলম্ব করা।
        [ওয়াজিব] ৩. দাঁড়িয়ে ‘রাব্বানা ওয়া লাকাল হামদ্’ বলা।
      </p>
      <h3>সিজদা অবস্থায় ২০ কাজ</h3>
      <p>
        ১. সিজদায় যাওয়া অবস্থায় তাকবীর বলা। উল্লেখ্য, কোন তাকবীরকে এক আলিফ
        থেকে লম্বা না করা। ২. হাঁটু মাটিতে লাগার আগ পর্যন্ত সিনা ও মাথা সোজা
        রাখা, বিলকুল না ঝুঁকানো। ৩. (প্রথমে) উভয় হাঁটু মাটিতে রাখা। ৪. (তারপর)
        হাঁটু থেকে এতটুকু দূরে হাত রাখা। যেন সিজদারত অবস্থায় উভয় রান সোজা
        থাকে। উল্লেখ্য, হাঁটু থেকে এক হাত পরিমাণ দূরে হাত রাখলে উরু সোজা থাকে।
        ৫. (তারপর) উভয় বৃদ্ধাঙ্গুল এর মাথা বরাবর নাক রাখা। ৬. (তারপর) কপাল
        রাখা। ৭. হাতের আঙ্গুলগুলো মিলিয়ে রাখা। ৮. আঙ্গুলের মাথাগুলো কিবলামুখী
        করে সোজাভাবে রাখা। ৯. দু’হাতের মধ্যখানে চেহারা রাখা যায় এ পরিমাণ ফাঁক
        রাখা। হাত চেহারার সাথে মিলিয়ে রাখবে না। ১০. নাকের অগ্রভাগের দিকে নজর
        রাখা। ১১. পেট উরু থেকে পৃথক রাখা। ১২. কনুই মাটি ও রান থেকে পৃথক রাখা।
        ১৩. উভয় উরু সোজাভাবে খাড়া রাখা। ১৪. উভয় পায়ের পাতা খাড়া রাখা। ১৫.
        পায়ের আঙ্গুলের মাথাগুলো যথাসম্ভব কিবলার দিকে মুড়িয়ে রাখা। ১৬. পায়ের
        আঙ্গুল জমিন থেকে না উঠানো। [ওয়াজিব]। ১৭. দু’পায়ের মধ্যখানে দাঁড়ানো
        অবস্থার ন্যায় চার আঙ্গুল পরিমাণ ফাঁক রাখা। ১৮. কমপক্ষে তিনবার সিজদার
        তাসবীহ্ (সুবহানা রাব্বিয়াল আ‘লা) পড়া। ১৯. সিজদা করা ফরয এবং সিজদায়
        কমপক্ষে এক তাসবীহ পরিমাণ দেরী করা ওয়াজিব। ২০. সিজদারত অবস্থায় উভয় রান
        সোজা রাখা।
      </p>
      <h3>সিজদা থেকে উঠার সময় ১৫ কাজ</h3>
      <p>
        ১. সিজদা থেকে উঠা অবস্থায় তাকবীর বলা। ২. (প্রথমে) কপাল উঠানো। ৩.
        (তারপর) নাক উঠানো। ৪. (তারপর) উভয় হাত উঠানো। ৫. দুই সিজদার মাঝখানে সোজা
        হয়ে স্থিরভাবে বসা। [ওয়াজিব]। ৬. বাম পা বিছিয়ে তার উপর বসা। ৭. ডান পা
        সোজাভাবে খাড়া রাখা। ৮. উভয় পায়ের আঙ্গুলসমূহ (সম্ভবমত) কিবলার দিকে মুড়িয়ে
        রাখা। ৯. উভয় হাত উরুর উপর (হাতের আঙ্গুলের মাথা) হাঁটু বরাবর রাখা ও
        হাতের আঙ্গুলসমূহ স্বাভাবিক অবস্হায় রাখা। ১০. নজর দুই হাঁটুর মাঝের দিকে
        রাখা। ১১. বসা অবস্থায় দু‘আ(আল্লাহুম্মাগফিরলী) বলা। ১২. তাকবীর বলা
        অবস্থায় দ্বিতীয় সিজদা করা। ১৩. দ্বিতীয় সিজদার পর তাকবীর বলা অবস্থায়
        পরবর্তী রাকা‘আতের জন্য পায়ের অগ্রভাগে ভর করে দাঁড়ানো। (দু’হাত দ্বারা
        জমিনের উপর টেক না লাগানো) ১৪. হাঁটুর উপর হাত রেখে দাঁড়ানো। ১৫. সিজদা
        হতে সিনা ও মাথা সোজা রেখে সরাসরি দাঁড়ানো।
      </p>
      <h3>বসায় ১২ কাজ</h3>
      <p>
        ১. বাম পা বিছিয়ে তার উপর বসা। ২. ডান পা সোজাভাবে খাড়া রাখা। ৩. উভয়
        পায়ের আঙ্গুলসমূহ (সম্ভবমত) কিবলার দিকে মুড়িয়ে রাখা। ৪. উভয় হাত রানের
        উপর (আঙ্গুলসমূহের মাথা) হাঁটু বরাবর রাখা। ৫. হাতের আঙ্গুলগুলো স্বাভাবিক
        অবস্থায় রাখা। ৬. বসা অবস্থায় মাথা ও পিঠসোজা রেখে নজর দুই হাটুর মাঝের
        দিকে রাখা। ৭. ‘আত্তাহিয়্যাতু’ পড়া। [ওয়াজিব] ৮. ‘আশহাদু’ বলার সঙ্গে
        সঙ্গে মধ্যমা ও বৃদ্ধাঙ্গুলির মাথা এক সঙ্গে মিলিয়ে এবং অনামিকা ও
        কনিষ্ঠাঙ্গুলদ্বয় মুড়িয়ে রেখে হালকা (গোল বৃত্ত আকারে) বাঁধা। ৯. ‘লা
        ইলাহা’ বলার সময় শাহাদাত আঙ্গুল সামান্য উঁচু করে ইশারা করা। অতঃপর
        ‘ইল্লাল্লাহু’ বলার সময় নামানো। তবে শাহাদত আঙ্গুলের মাথা হাঁটুর সাথে
        মিলাবে না। ১০. বৈঠক শেষ হওয়া পর্যন্ত হাত ঐরূপ হালকা বাঁধা অবস্থায় রাখা
        এবং শেষ বৈঠকে উভয় সালামের পরে খোলা। ১১. আখেরী বৈঠক (আত্তাহিয়্যাতুর পর)
        দরূদ শরীফ পড়া। ১২. অতঃপর দু‘আয়ে মাসুরা পড়া।
      </p>
      <h3>সালাম ফিরানোতে ৮ কাজ</h3>
      <p>
        ১. একা নামায পড়লে উভয় সালামের সময় ফেরেশতাদেরকে সালাম করার নিয়ত করা
        এবং জামা‘আতের সময় উভয় সালামে ইমাম, অন্যান্য মুসল্লী, ফেরেশতা ও নামাযী
        জ্বিনদের সালাম করার নিয়ত করা। ২. উভয় সালাম কিবলার দিক থেকে শুরু করা
        এবং উভয় সালামে ‘আসসালামু’ বলা পর্যন্ত চেহারা কিবলার দিকে রাখা। ৩.
        প্রথমে ডান দিকে, অতঃপর বাম দিকে সালাম ফিরানো। ৪. সালামের সময় ডানে-বামে
        শুধু চেহারা ফিরানো (সিনা না ফিরানো)। ৫. আলাইকুম বলার সময় নজর কাঁধের
        দিকে ফিরানো। ৬. দ্বিতীয় সালাম, প্রথম সালামের তুলনায় আস্তে বলা। ৭.
        মুক্তাদীগণের ইমামের ‘আসসালামু’ বলার পর সালাম ফিরানো। ৮. মাসবুকের জন্য
        ইমামের দ্বিতীয় সালাম শেষ করা পর্যন্ত অপেক্ষা করা।
      </p>
      <h3>পুরো নামাযে ৬ মাসাইল</h3>
      <p>
        ১. নামাযের শুরু থেকে শেষ পর্যন্ত অন্তরে নামাযের খেয়াল রাখা, আর সহজ
        পদ্ধতি হল সব কিছু খেয়াল করে পড়া। মুখস্তের জোরে না পড়া। (মন অন্য কোন
        দিকে চলে গেলে, স্মরণ হওয়া মাত্রই ফিরিয়ে আনা) ২. মাঝের তাকবীরগুলো
        পূর্ববর্তী রুকন থেকে আরম্ভ করে অপর রুকনে পৌঁছে শেষ করা। (কিন্তু তাকবীর
        এক আলিফ থেকে লম্বা করা যাবে না।) এর জন্য কোন মুহাক্বিক আলিম থেকে নামাযের
        বাস্তব প্রশিক্ষণ নেওয়া জরুরী। ৩. এক রুকন থেকে অন্য রুকনে যেতে বিলম্ব না
        করা। ৪. পঠিত সূরা/ দু‘আ সমূহের প্রতি অন্তরে খেয়াল করা। ৫. হাই আসলে
        যথাসম্ভব মুখ বন্ধ রাখতে চেষ্টা করা। ৬. হাঁচি আসলে তা যথাসম্ভব দমিয়ে
        রাখা।
      </p>
    </div>
  );
}

export default PuruserNamaj;
