import React from "react";

function Sajj() {
  const sajj = [
    {
      id: 1,
      name: "আয়না দেখার দু’আ",
      arabic:
        "اَلْحَمْدُ لِلّٰهِ اَللّٰهُمَّ كَمَا حَسَّنْتَ خَلْقِيْ فَحَسِّنْ خُلُقِيْ",
      bangla:
        " আলহামদু লিল্লাাহি আল্লাাহুম্মা কামাা হাসসানতা খলক্বী ফাহাসসিন খুলুক্বী।",
      meaning:
        "সকল প্রশংসা আল্লাহর, হে আল্লাহ্‌! আপনি আমাকে যেরূপ সুন্দর চেহারা দান করেছেন তদ্রূপ আমার স্বভাব- চরিত্রকেও সুন্দর করে দিন।",
    },
    {
      id: 2,
      name: "নতুন কাপড় পরিধানের দু’আ",
      arabic:
        "ٖاَلْحَمْدُ لِلّٰهِ الَّذِيْ كَسَانِىْ مَا اُوَارِيْ بِهٖ عَوْرَتِـيْ وَاَتَجَمَّلُ بِهٖ فِيْ حَيَاتِيْ",
      bangla:
        "আলহামদু লিল্লাা হিল্লাযী কাসাানী মাা উ ওয়াারী বিহী ‘আউরতী ওয়া আতা জামমালু বিহী ফী হায়াাতী।",
      meaning:
        "সমস্ত প্রশংসা আল্লাহ তায়ালার জন্য যিনি আমাকে কাপড় পরিধান করাইয়াছেন, এই কাপড় দ্বারা আমি আমার ছতর ঢাকি এবং আপন জিন্দেগিতে উহা দ্বারা সাজসজ্জা হাসিল করি।",
    },
    {
      id: 3,
      name: "কাপড় পরিধানের দু‘আ",
      arabic:
        "اَلْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلا قُوَّةٍ.",
      bangla:
        "আলহামদু লিল্লাা হিল্লাযী কাসাানী হাাযাস সাউবা ওয়া রযা ক্বনীহি মিন গইরি হাওলিম মিন্নী ওয়ালাা কুউওয়াহ।",
      meaning:
        "সমস্ত প্রশংসা সেই আল্লাহর জন্য যিনি আমাকে এই পোষাক পরিধান করাইয়াছেন এবং আমার চেষ্টা ও সামর্থ্য ছাড়া আমাকে ইহা নসীব করিয়াছেন।",
    },
    {
      id: 4,
      name: "নতুন কাপড় পরিধানের দু’আ",
      arabic:
        "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
      bangla:
        " আল্লাহুম্মা লাকাল হামদু আংতা কাসাওতানিহি আস’আলুকা মিন খাইরিহি ওয়া খাইরিমা ছুনি’য়া লাহু ওয়া আঊযুবিকা মিন শাররিহি ওয়া শাররি-মা ছুনি’য়া লাহ।",
      meaning:
        " হে আল্লাহ! আপনারই সকল প্রশংসা, আপনিই আমাকে এই পোশাকটি পরিধান করিয়েছেন। আমি আপনার কাছে এর কল্যাণ ও মঙ্গল প্রর্থনা করছি এরং এর উদপাদনের মধ্যে যত কল্যাণ ও মঙ্গল রয়েছে তা প্রার্থনা করছি। আর আমি আপনার আশ্রয় গ্রহণ করছি এর অকল্যাণ থেকে এবং এর উৎপাদনের মধ্যে যা কিছু অকল্যাণলকর রয়েছে তা থেকে।",
    },
    {
      id: 5,
      name: "কাউকে নতুন পোশাক পরিধান করতে দেখলে",
      arabic: "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
      bangla: "তুবলি ওয়া ইয়ুখলিফুল্লাহু তায়ালা।",
      meaning:
        "এই পোশাক তোমার দেহেই পুরাতন ও জীর্ণ হয়ে যাক এবং মহান আল্লাহ এর পরিবর্তে অন্য পোশাক তোমাকে দান করুন।",
    },
  ];
  return (
    <div className="relative text-xl bg-[#e8e9f3] text-[#2e424d] px-[100px] py-10">
      <h1 className="bg-[#98dad9] text-center py-5 my-10 rounded-md font-bold text-xl">
        সাজ সজ্জা
      </h1>
      <ul className="space-y-2">
        {sajj.map((data, id) => (
          <li
            key={id}
            className="space-y-3 p-4 border border-[#a6a6a8] rounded-lg"
          >
            <h1 className="text-xl font-bold mb-2 mt-2">{data.name}</h1>
            <div className="border-[1px] border-[#98dad9]"></div>
            <p className="text-center font-bold py-5">{data.arabic}</p>
            <p>
              <span className="font-bold">উচ্চারণঃ </span>
              {data.bangla}
            </p>
            <p>
              <span className="font-bold">অর্থঃ </span>
              {data.meaning}
            </p>
          </li>
        ))}
      </ul>
    </div>
  );
}

export default Sajj;
